/*************************************************************************//*!
					
					@file	SLSound.h
					@brief	OpenSLでの各種サウンドの処理を行うクラス。

															@author	濱田　享
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SLSOUND__H__

#define		__SLSOUND__H__

//INCLUDE
#include	"../Sound.h"

namespace Mof {
	
	/*******************************//*!
	@brief	サウンド基底インターフェイス

			サウンドの基底となるインターフェイス。

	@author	濱田　享
	*//********************************/
	class MOFLIBRARY_API CSLSound : public ISound {
	protected:
		/*******************//*!
		SLオブジェクト
		*//********************/
		SLObjectItf				m_SLObject;
		/*******************//*!
		SLエンジン
		*//********************/
		SLEngineItf				m_SLEngine;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CSLSound();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CSLSound();

		/*************************************************************************//*!
				@brief			サウンドオブジェクトの生成
				@param[in]		pInfo		サウンドの生成情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPSOUNDCREATEINFO pInfo);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			サウンドデバイス取得<br>
								使用しない環境で呼び出した場合NULLを返す。
				@param			None

				@return			サウンドデバイス
		*//**************************************************************************/
		virtual MofSoundDevice GetDevice(void);

		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CSLSound,MOF_SLSOUNDCLASS_ID);
	};

	#include	"SLSound.inl"
}

#endif

//[EOF]