/*************************************************************************//*!
					
					@file	SLStreamingSoundBuffer.h
					@brief	XAudio2での各種サウンドバッファの処理を行う基底インターフェイス。

															@author	濱田　享
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SLSTREAMINGSOUNDBUFFER__H__

#define		__SLSTREAMINGSOUNDBUFFER__H__

//INCLUDE
#include	"../SoundBufferBase.h"

namespace Mof {
	

	/*******************************//*!
	@brief	XAudio2でのサウンドバッファクラス

			XAudio2でのサウンドバッファクラス。

	@author	濱田　享
	*//********************************/
	class MOFLIBRARY_API CSLStreamingSoundBuffer : public CSoundBufferBase {
	protected:
		/*******************//*!
		SLOutputMix
		*//********************/
		SLObjectItf					m_OutputMix;
		/*******************//*!
		SLプレイヤーオブジェクト
		*//********************/
		SLObjectItf					m_PlayerObject;
		/*******************//*!
		SLPlay
		*//********************/
		SLPlayItf					m_PlayerPlay;
		/*******************//*!
		1秒のバイト数
		*//********************/
		MofU32						m_BytesPerSec;
		/*******************//*!
		再生カーソル
		*//********************/
		MofU32						m_AddedDataSize;
		/*******************//*!
		再生カーソル
		*//********************/
		MofU32						m_AddedDataNo;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CSLStreamingSoundBuffer();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj			コピーバッファ

				@return			None
		*//**************************************************************************/
		CSLStreamingSoundBuffer(const CSLStreamingSoundBuffer& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CSLStreamingSoundBuffer();

		/*************************************************************************//*!
				@brief			サウンドの読み込み
				@param[in]		pName			ファイル名
				@param[in]		Flags			読み込みフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Load(LPCMofChar pName,const MofU32 Flags = 0);
		/*************************************************************************//*!
				@brief			サウンドの読み込み
				@param[in]		pName			名前
				@param[in]		pData			メモリアドレス
				@param[in]		Size			サイズ
				@param[in]		Flags			読み込みフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Load(LPCMofChar pName,LPMofVoid pData,MofU32 Size,const MofU32 Flags = 0);
		
		/*************************************************************************//*!
				@brief			サウンドの更新
				@param			None
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Update(void);
		/*************************************************************************//*!
				@brief			サウンドの再生
				@param			None
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Play(void);
		/*************************************************************************//*!
				@brief			サウンドの再生
				@param[out]		on				再生開始番号
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Play(MofU32& on);
		
		/*************************************************************************//*!
				@brief			サウンドの一時停止
				@param			None
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Pause(void);
		/*************************************************************************//*!
				@brief			サウンドの一時停止
				@param[in]		n				再生番号
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Pause(MofU32 n);
		/*************************************************************************//*!
				@brief			サウンドの再開
				@param			None
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Resume(void);
		/*************************************************************************//*!
				@brief			サウンドの再開
				@param[in]		n				再生番号
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Resume(MofU32 n);
		
		/*************************************************************************//*!
				@brief			サウンドの停止
				@param			None
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Stop(void);
		/*************************************************************************//*!
				@brief			サウンドの停止
				@param[in]		n				再生番号
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Stop(MofU32 n);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		/*************************************************************************//*!
				@brief			再生中か判定
				@param			None

				@return			TRUE			再生している<br>
								FALSE			再生していない
		*//**************************************************************************/
		virtual MofBool IsPlay(void);
		/*************************************************************************//*!
				@brief			再生中か判定
				@param[in]		n				再生番号

				@return			TRUE			再生している<br>
								FALSE			再生していない
		*//**************************************************************************/
		virtual MofBool IsPlay(MofU32 n);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			再生音量設定
				@param[in]		Vol			音量(0.0(無音)～1.0(通常))
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetVolume(MofFloat Vol);
		/*************************************************************************//*!
				@brief			再生ピッチ設定
				@param[in]		Pitch		ピッチ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetPitch(MofFloat Pitch);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			サウンドバッファ取得
				@param			None

				@return			サウンドバッファ
		*//**************************************************************************/
		virtual MofSoundBuffer GetBuffer(void);
		/*************************************************************************//*!
				@brief			音ファイルの時間取得
				@param			None
				
				@return			音ファイルの時間
		*//**************************************************************************/
		virtual MofFloat GetPlayTime(void);
		
		//クラス基本定義
		MOF_LIBRARYCLASS(CSLStreamingSoundBuffer,MOF_SLSTREAMINGSOUNDBUFFERCLASS_ID);
	};

	#include	"SLStreamingSoundBuffer.inl"

	//置き換え
	typedef CSLStreamingSoundBuffer		CStreamingSoundBuffer;
}

#endif

//[EOF]
