/*************************************************************************//*!
					
					@file	Sound.h
					@brief	各種サウンドの処理を行う基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SOUND__H__

#define		__SOUND__H__

//INCLUDE
#include	"SoundCommon.h"

namespace Mof {
	
	/*******************************//*!
	@brief	サウンド生成情報構造体

			サウンドの生成に必要な情報をまとめた構造体

	@author	CDW
	*//********************************/
	typedef struct tag_SOUNDCREATEINFO {
		MofU32					Size;						//!<構造体サイズ
		MofU32					Flags;						//!<生成フラグ

		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		tag_SOUNDCREATEINFO() :
		Size(sizeof(tag_SOUNDCREATEINFO)),
		Flags(0) {
		}
	}SOUNDCREATEINFO,*LPSOUNDCREATEINFO;

	/*******************************//*!
	@brief	サウンド基底インターフェイス

			サウンドの基底となるインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API ISound : public IMofObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			サウンドオブジェクトの生成
				@param[in]		pInfo		サウンドの生成情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPSOUNDCREATEINFO pInfo) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			サウンドデバイス取得<br>
								使用しない環境で呼び出した場合NULLを返す。
				@param			None

				@return			サウンドデバイス
		*//**************************************************************************/
		virtual MofSoundDevice GetDevice(void) = 0;
	};

	//ポインタ置き換え
	typedef ISound*				LPSound;
}

#endif

//[EOF]