/*************************************************************************//*!
					
					@file	XAudioSound.h
					@brief	XAudio2での各種サウンドの処理を行うクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__XAUDIOSOUND__H__

#define		__XAUDIOSOUND__H__

//INCLUDE
#include	"../Sound.h"

namespace Mof {
	
	/*******************************//*!
	@brief	サウンド基底インターフェイス

			サウンドの基底となるインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CXAudioSound : public ISound {
	protected:
		/*******************//*!
		XAudio2オブジェクト
		*//********************/
		IXAudio2*					m_pSound;
		/*******************//*!
		マスター
		*//********************/
		IXAudio2MasteringVoice*		m_pMastering;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CXAudioSound();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CXAudioSound();

		/*************************************************************************//*!
				@brief			サウンドオブジェクトの生成
				@param[in]		pInfo		サウンドの生成情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPSOUNDCREATEINFO pInfo);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			サウンドデバイス取得<br>
								使用しない環境で呼び出した場合NULLを返す。
				@param			None

				@return			サウンドデバイス
		*//**************************************************************************/
		virtual MofSoundDevice GetDevice(void);

		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CXAudioSound,MOF_XAUDIOSOUNDCLASS_ID);
	};

	#include	"XAudioSound.inl"
}

#endif

//[EOF]