/*************************************************************************//*!
					
					@file	CRC32.h
					@brief	CRC32ハッシュ生成を行うクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__CRC32__H__

#define		__CRC32__H__

//INCLUDE
#include	"String.h"

namespace Mof {
	
	/*******************************//*!
	@brief	CRC32ハッシュ生成を行うスタティッククラス

			CRC32ハッシュ生成を行うスタティッククラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CCRC32 {
	private:
	public:
		/*************************************************************************//*!
				@brief			ハッシュ生成
				@param[in]		pData			ハッシュ生成データ
				@param[in]		s				ハッシュ生成データサイズ

				@return			発生したハッシュコードを返す
		*//**************************************************************************/
		static MofU32 CreateHash(LPCMofVoid pData,MofU32 s);
		/*************************************************************************//*!
				@brief			ハッシュ生成
				@param[in]		pStr			ハッシュ生成文字列

				@return			発生したハッシュコードを返す
		*//**************************************************************************/
		static MofU32 CreateHash(LPCMofChar pStr);
		/*************************************************************************//*!
				@brief			ハッシュ生成
				@param[in]		pStr			ハッシュ生成文字列

				@return			発生したハッシュコードを返す
		*//**************************************************************************/
		static MofU32 CreateHash(const LPString pStr);

	private:
		//作成を禁止する
		CCRC32(){};
		CCRC32(const CCRC32& pObj){};
	};
	
	//INLINE INCLUDE
	#include	"CRC32.inl"

}

#endif

//[EOF]