/*************************************************************************//*!
					
					@file	Lock.h
					@brief	ロック（POSIXならMutex、Winならクリティカルセクション）

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__LOCK__H__

#define		__LOCK__H__

//INCLUDE
#include	"DynamicArray.h"

namespace Mof {
	
	/*******************************//*!
	@brief	ロック

			ロック

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CLock : public IMofBase {
	protected:
		/*******************//*!
		ロックハンドル
		*//********************/
		MofLock			m_Handle;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CLock();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CLock();

		/*************************************************************************//*!
				@brief			ロック
				@param			None

				@return			None
		*//**************************************************************************/
		void Lock(void);
		/*************************************************************************//*!
				@brief			アンロック
				@param			None

				@return			None
		*//**************************************************************************/
		void UnLock(void);
		/*************************************************************************//*!
				@brief			ロック確認
				@param			None

				@return			TRUE			成功<br>
								それ以外		失敗
		*//**************************************************************************/
		MofBool TryLock(void);

		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CLock, MOF_LOCKCLASS_ID);
	};
	typedef CLock* LPLock;
	
	/*******************************//*!
	@brief	セマフォ

			セマフォ

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CSemaphore : public IMofBase {
	protected:
		/*******************//*!
		ロックハンドル
		*//********************/
		MofSemaphore	m_Handle;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CSemaphore();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CSemaphore();
		
		/*************************************************************************//*!
				@brief			終了
				@param			None

				@return			None
		*//**************************************************************************/
		void Signal(void);
		/*************************************************************************//*!
				@brief			待機
				@param			None

				@return			None
		*//**************************************************************************/
		void Wait(void);
		/*************************************************************************//*!
				@brief			待機
				@param			None

				@return			None
		*//**************************************************************************/
		void Poll(void);

		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CSemaphore, MOF_SEMAPHORECLASS_ID);
	};

	/*******************************//*!
	@brief	ロック

			ロック

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CFocusLock : public IMofBase {
	private:
		/*******************//*!
		ロック
		*//********************/
		CLock*				m_pLock;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pl			ロックポインタ

				@return			None
		*//**************************************************************************/
		CFocusLock(CLock* pl);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CFocusLock();
		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CFocusLock, MOF_FOCUSLOCKCLASS_ID);
	};

	#include	"Lock.inl"
}

#endif

//[EOF]