/*************************************************************************//*!
					
					@file	DX11Mesh.h
					@brief	DirectX11メッシュクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__DX11MESH__H__

#define		__DX11MESH__H__

//INCLUDE
#include	"../MeshBase.h"
#include	"DX11Geometry.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュ基底クラス

			メッシュ基底クラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CDX11Mesh : public CMeshBase {
	private:
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CDX11Mesh();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピージオメトリ

				@return			None
		*//**************************************************************************/
		CDX11Mesh(const CDX11Mesh& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CDX11Mesh();
		
		/*************************************************************************//*!
				@brief			メッシュのコピー生成
				@param			None
				
				@return			作成されたコピーメッシュ<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IMesh* CreateCopyObject(void) const;
				
		//クラス基本定義
		MOF_LIBRARYCLASS(CDX11Mesh,MOF_DX11MESHCLASS_ID);
	};

	#include	"DX11Mesh.inl"
	
	//置き換え
	typedef CDX11Mesh		CMesh;
}

#endif	//__DX11MESH__H__

//[EOF]
