/*************************************************************************//*!
					
					@file	DX11VertexBuffer.h
					@brief	DirectX11頂点バッファクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__DX11VERTEXBUFFER__H__

#define		__DX11VERTEXBUFFER__H__

//INCLUDE
#include	"../VertexBufferBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	DirectX11頂点バッファクラス

			DirectX11での頂点バッファの作成、設定を行うためのインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CDX11VertexBuffer : public CVertexBufferBase {
	protected:
		/*******************//*!
		頂点バッファ
		*//********************/
		MofVertexBuffer				m_pBuffer;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CDX11VertexBuffer();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーバッファ

				@return			None
		*//**************************************************************************/
		CDX11VertexBuffer(const CDX11VertexBuffer& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CDX11VertexBuffer();
		
		/*************************************************************************//*!
				@brief			バッファの作成
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool CreateBuffer(void);
		/*************************************************************************//*!
				@brief			コピーバッファの作成
				@param			None

				@return			作成されたコピーバッファ<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IVertexBuffer* CreateCopyObject(void) const;
		
		/*************************************************************************//*!
				@brief			バッファのマップ
				@param[in]		mt				マップタイプ
				
				@return			マップされたメモリアドレスを返す。<br>
								失敗の場合NULLになる。
		*//**************************************************************************/
		virtual LPMofVoid Map(MofU32 mt);
		/*************************************************************************//*!
				@brief			バッファのアンマップ
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool UnMap(void);
		/*************************************************************************//*!
				@brief			バッファの更新
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool UpdateBuffer(void);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			頂点バッファ取得
				@param			None

				@return			頂点バッファの取得
		*//**************************************************************************/
		virtual MofVertexBuffer GetBuffer(void) const;
		
		//クラス基本定義
		MOF_LIBRARYCLASS(CDX11VertexBuffer,MOF_DX11VERTEXBUFFERCLASS_ID);
	};

	#include	"DX11VertexBuffer.inl"
	
	//置き換え
	typedef CDX11VertexBuffer	CVertexBuffer;
}

#endif

//[EOF]