/*************************************************************************//*!
					
					@file	DX11ShaderBufferBase.h
					@brief	DirectX11シェーダーバッファクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__DX11SHADERBUFFER__H__

#define		__DX11SHADERBUFFER__H__

//INCLUDE
#include	"../ShaderBufferBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シェーダーインターフェイス

			シェーダーへのパラメーター設定をおこなうためのバッファインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CDX11ShaderBuffer : public CShaderBufferBase {
	protected:
		/*******************//*!
		コンスタントバッファ
		*//********************/
		ID3D11Buffer*							m_pConstBuffer;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CDX11ShaderBuffer();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーシェーダー

				@return			None
		*//**************************************************************************/
		CDX11ShaderBuffer(const CDX11ShaderBuffer& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CDX11ShaderBuffer();
		
		/*************************************************************************//*!
				@brief			バッファの生成
				@param[in]		pShader		シェーダー
				@param[in]		pName		バッファ名
				@param[in]		size		バッファサイズ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPShader pShader, LPCMofChar pName,const MofU32 size);
		
		/*************************************************************************//*!
				@brief			バインドの実行
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Bind(void);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			バッファの設定
				@param[in]		pData		データ
					
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetBuffer(LPMofVoid pData);
		/*************************************************************************//*!
				@brief			バッファの設定
				@param[in]		pData		データ
				@param[in]		off			オフセット
				@param[in]		s			サイズ
					
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetBuffer(LPMofVoid pData,MofU32 off,MofU32 s);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------

		//クラス基本定義
		MOF_LIBRARYCLASS(CDX11ShaderBuffer, MOF_DX11SHADERBUFFERCLASS_ID);
	};

	#include	"DX11ShaderBuffer.inl"

	//置き換え
	typedef CDX11ShaderBuffer		CShaderBuffer;
}

#endif

//[EOF]