/*****************************************************************************
					
					［ファイル名］	CCDJoint.h
					［処理概要］	CCD用関節クラス
					
															@author	CDW
															@date	2014.05.14
*****************************************************************************/

//ONCE
#ifndef		__CCDJOINT__H__

#define		__CCDJOINT__H__

//INCLUDE
#include	"Bone.h"

namespace Mof {

	//前方定義
	class CCCDJoint;
	typedef CCCDJoint* LPCCDJoint;
	typedef CDynamicArray< LPCCDJoint > CCCDJointArray, *LPCCDJointArray;

	//CLASS
	
	/*******************************//*!
	@brief	IK用関節クラス

			IK用関節クラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CCCDJoint : public IMofNamedObject {
	protected:
		/*******************//*!
		設定
		*//********************/
		BONEIKJOINT							m_Info;
		/*******************//*!
		設定ボーン
		*//********************/
		LPBone								m_pBone;
		/*******************//*!
		親関節
		*//********************/
		LPCCDJoint							m_pParent;
		/*******************//*!
		子関節
		*//********************/
		LPCCDJointArray						m_pChildren;
		/*******************//*!
		行列
		*//********************/
		CMatrix44							m_JointMatrix;
		/*******************//*!
		位置
		*//********************/
		CVector3							m_Position;
		/*******************//*!
		スケール
		*//********************/
		CVector3							m_Scaling;
		/*******************//*!
		姿勢
		*//********************/
		CQuaternion							m_Orientation;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ<br>
								全てのパラメーターをデフォルトで作成する。
				@param			None

				@return			None
		*//**************************************************************************/
		CCCDJoint();
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		Info		設定
				@param[in]		pBone		ボーン
				@param[in]		pParent		親

				@return			None
		*//**************************************************************************/
		CCCDJoint(BONEIKJOINT& Info, LPBone pBone, LPCCDJoint pParent);
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		Info		設定
				@param[in]		pBone		ボーン
				@param[in]		pParent		親
				@param[in]		mat			マトリクス

				@return			None
		*//**************************************************************************/
		CCCDJoint(BONEIKJOINT& Info, LPBone pBone, LPCCDJoint pParent,CMatrix44& mat);
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーボーン

				@return			None
		*//**************************************************************************/
		CCCDJoint(const CCCDJoint& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CCCDJoint();
		/*************************************************************************//*!
				@brief			子の追加
				@param[in]		p			追加する子供
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		MofBool AddChild(LPCCDJoint p);
		/*************************************************************************//*!
				@brief			行列の更新
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		MofBool UpdateMatrix(void);
		/*************************************************************************//*!
				@brief			行列の更新
				@param[in]		wMat			更新行列
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		MofBool UpdateMatrix(const Matrix44& wMat);
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			親設定
				@param[in]		p				親
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		MofBool SetParent(LPCCDJoint p);
		/*************************************************************************//*!
				@brief			行列設定
				@param[in]		m				行列
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		MofBool SetMatrix(CMatrix44& m);
		/*************************************************************************//*!
				@brief			位置設定
				@param[in]		p				位置
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		MofBool SetPosition(Vector3& p);
		/*************************************************************************//*!
				@brief			姿勢設定
				@param[in]		q				姿勢
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		MofBool SetOrientation(Quaternion& q);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			ボーン取得
				@param			None

				@return			ボーン
		*//**************************************************************************/
		LPBone GetBone(void);
		/*************************************************************************//*!
				@brief			設定情報取得
				@param			None

				@return			設定情報
		*//**************************************************************************/
		BONEIKJOINT& GetInfo(void);
		/*************************************************************************//*!
				@brief			親取得
				@param			None

				@return			親
		*//**************************************************************************/
		LPCCDJoint GetParent(void);
		/*************************************************************************//*!
				@brief			子取得
				@param			None

				@return			子
		*//**************************************************************************/
		LPCCDJointArray GetChildren(void);
		/*************************************************************************//*!
				@brief			子取得
				@param[in]		No			番号

				@return			子
		*//**************************************************************************/
		LPCCDJoint GetChild(MofU32 No);
		/*************************************************************************//*!
				@brief			子取得
				@param[in]		pName		名前

				@return			子
		*//**************************************************************************/
		LPCCDJoint GetJoint(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			行列取得
				@param			None

				@return			行列
		*//**************************************************************************/
		CMatrix44& GetMatrix(void);
		/*************************************************************************//*!
				@brief			位置取得
				@param			None

				@return			位置
		*//**************************************************************************/
		CVector3& GetPosition(void);
		/*************************************************************************//*!
				@brief			姿勢取得
				@param			None

				@return			姿勢
		*//**************************************************************************/
		CQuaternion& GetOrientation(void);
		/*************************************************************************//*!
				@brief			制限取得
				@param			None

				@return			制限
		*//**************************************************************************/
		MofFloat GetRestriction(void);
		/*************************************************************************//*!
				@brief			比率取得
				@param			None

				@return			比率
		*//**************************************************************************/
		MofFloat GetWeight(void);
		/*************************************************************************//*!
				@brief			制限取得
				@param			None

				@return			制限
		*//**************************************************************************/
		CVector3& GetMinSingleRestriction(void);
		/*************************************************************************//*!
				@brief			制限取得
				@param			None

				@return			制限
		*//**************************************************************************/
		CVector3& GetMaxSingleRestriction(void);
		/*************************************************************************//*!
				@brief			制限取得
				@param			None

				@return			制限
		*//**************************************************************************/
		CVector3& GetMinRestriction(void);
		/*************************************************************************//*!
				@brief			制限取得
				@param			None

				@return			制限
		*//**************************************************************************/
		CVector3& GetMaxRestriction(void);

		//クラス基本定義
		MOF_LIBRARYCLASS(CCCDJoint, MOF_CCDIKJOINTCLASS_ID);
	};

	//INLINE INCLUDE
	#include	"CCDJoint.inl"

}

#endif		//__CCDJOINT__H__

//[EOF]