/*************************************************************************//*!
					
					@file	DepthTarget.h
					@brief	深度ターゲット基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__DEPTHTARGET__H__

#define		__DEPTHTARGET__H__

//INCLUDE
#include	"Graphics.h"

namespace Mof {
	
	/*******************************//*!
	@brief	深度ターゲット基底インターフェイス

			深度ターゲットの基底となるインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IDepthTarget : public IMofObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			深度ターゲットの生成
				@param[in]		pGraphics	グラフィックスインターフェイス
				@param[in]		Width		深度バッファ幅
				@param[in]		Height		深度バッファ高さ
				@param[in]		Format		深度バッファフォーマット
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPGraphics pGraphics, MofU32 Width, MofU32 Height, PixelFormat Format) = 0;
										
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			クリア深度値取得設定
				@param			Value	クリア深度値

				@return			None
		*//**************************************************************************/
		virtual void SetClearDepth(MofFloat Value) = 0;
		/*************************************************************************//*!
				@brief			クリアステンシル値設定
				@param			Value	クリアステンシル値

				@return			None
		*//**************************************************************************/
		virtual void SetClearStencil(MofU32 Value) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			深度ターゲット取得
				@param			None

				@return			深度ターゲット
		*//**************************************************************************/
		virtual MofDepthTarget GetTarget(void) = 0;
		/*************************************************************************//*!
				@brief			クリア深度値取得
				@param			None

				@return			クリア深度値
		*//**************************************************************************/
		virtual MofFloat GetClearDepth(void) = 0;
		/*************************************************************************//*!
				@brief			クリアステンシル値取得
				@param			None

				@return			クリアステンシル値
		*//**************************************************************************/
		virtual MofU32 GetClearStencil(void) = 0;
	};

	//ポインタ置き換え
	typedef IDepthTarget*		LPDepthTarget;
}

#endif

//[EOF]