/*************************************************************************//*!
					
					@file	DirectionalLight.h
					@brief	方向光源クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__DIRECTIONALLIGHT__H__

#define		__DIRECTIONALLIGHT__H__

//INCLUDE
#include	"LightBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	方向光源クラス

			方向光源クラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CDirectionalLight : public CLightBase {
	protected:
		/*******************//*!
		方向
		*//********************/
		CVector3					m_Direction;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CDirectionalLight();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーマテリアル

				@return			None
		*//**************************************************************************/
		CDirectionalLight(const CDirectionalLight& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CDirectionalLight();

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			ライト方向設定
				@param[in]		v			方向
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetDirection(const Vector3& v);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			ライトタイプ取得
				@param			None

				@return			ライトタイプ
		*//**************************************************************************/
		virtual LightType GetType(void) const;
		/*************************************************************************//*!
				@brief			ライト方向取得
				@param			None

				@return			ライト方向
		*//**************************************************************************/
		virtual CVector3& GetDirection(void);
		/*************************************************************************//*!
				@brief			ライト方向取得
				@param			None

				@return			ライト方向
		*//**************************************************************************/
		virtual const CVector3& GetDirection(void) const;

		//クラス基本定義
		MOF_LIBRARYCLASS(CDirectionalLight,MOF_DIRECTIONALLIGHTCLASS_ID);
	};
	
	//ポインタ置き換え
	typedef CDirectionalLight*			LPDirectionalLight;

	#include	"DirectionalLight.inl"
}

#endif

//[EOF]