/*************************************************************************//*!
					
					@file	GeometryMorphingBase.h
					@brief	ジオメトリモーフィング基底クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__GEOMETRYMORPHINGANIMATIONBASE__H__

#define		__GEOMETRYMORPHINGANIMATIONBASE__H__

//INCLUDE
#include	"GeometryMorphing.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュアニメーション基底クラス

			メッシュアニメーション基底となるクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CGeometryMorphing : public IGeometryMorphing {
	protected:
		/*******************//*!
		名前
		*//********************/
		CString								m_Name;
		/*******************//*!
		頂点座標モーフィング
		*//********************/
		LPGeometryMorphingPositionArray		m_pPosition;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CGeometryMorphing();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーメッシュアニメーション

				@return			None
		*//**************************************************************************/
		CGeometryMorphing(const CGeometryMorphing& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CGeometryMorphing();
		
		/*************************************************************************//*!
				@brief			メッシュアニメーションのコピー生成
				@param			None
				
				@return			作成されたコピーCGeometryMorphing<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IGeometryMorphing* CreateCopyObject(void) const;

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			頂点座標モーフィング設定<br>
								古いデータがある場合解放される
				@param[in]		pArray			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetMorphingPosition(LPGeometryMorphingPositionArray pArray);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			頂点座標モーフィング取得
				@param			None

				@return			頂点座標モーフィング
		*//**************************************************************************/
		virtual LPGeometryMorphingPositionArray GetMorphingPosition(void);

		//クラス基本定義
		MOF_LIBRARYCLASS(CGeometryMorphing,MOF_GEOMETRYMORPHINGANIMATIONCLASS_ID);
	};

	#include	"GeometryMorphingBase.inl"

}

#endif

//[EOF]