/*************************************************************************//*!
					
					@file	IndexBufferBase.h
					@brief	インデックスバッファ基底クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__INDEXBUFFERBASE__H__

#define		__INDEXBUFFERBASE__H__

//INCLUDE
#include	"IndexBuffer.h"

namespace Mof {
	
	/*******************************//*!
	@brief	インデックスバッファ基底クラス

			インデックスバッファの作成、設定を行うための基底クラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CIndexBufferBase : public IIndexBuffer {
	protected:
		/*******************//*!
		インデックスデータ
		*//********************/
		LPMofVoid					m_pIndex;
		/*******************//*!
		インデックスサイズ
		*//********************/
		MofU32						m_Size;
		/*******************//*!
		インデックス数
		*//********************/
		MofU32						m_Count;
		/*******************//*!
		バッファ管理方法
		*//********************/
		BufferAccess				m_Usage;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CIndexBufferBase();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーバッファ

				@return			None
		*//**************************************************************************/
		CIndexBufferBase(const CIndexBufferBase& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CIndexBufferBase();
		
		/*************************************************************************//*!
				@brief			バッファの作成
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool CreateBuffer(void) = 0;
		/*************************************************************************//*!
				@brief			バッファの作成
				@param[in]		s				サイズ
				@param[in]		c				数
				@param[in]		pInd			インデックスデータ
				@param[in]		Usage			利用方法
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool CreateBuffer(const MofU32 s, const MofU32 c, LPCMofVoid pInd, const BufferAccess Usage);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			バッファの設定
				@param[in]		s				サイズ
				@param[in]		c				数
				@param[in]		pInd			インデックスデータ
				@param[in]		Usage			利用方法
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetBufferData(const MofU32 s, const MofU32 c, LPCMofVoid pInd, const BufferAccess Usage);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			インデックス取得
				@param			None

				@return			インデックスの取得
		*//**************************************************************************/
		virtual LPMofVoid GetIndex(void) const;
		/*************************************************************************//*!
				@brief			インデックス取得
				@param			None

				@return			インデックスの取得<br>
								サイズが16bitインデックスではない場合NULL
		*//**************************************************************************/
		virtual LPMofU16 GetIndexU16(void);
		/*************************************************************************//*!
				@brief			インデックス取得
				@param			None

				@return			インデックスの取得<br>
								サイズが32bitインデックスではない場合NULL
		*//**************************************************************************/
		virtual LPMofU32 GetIndexU32(void);
		/*************************************************************************//*!
				@brief			インデックスサイズ取得
				@param			None

				@return			インデックスサイズの取得
		*//**************************************************************************/
		virtual MofU32 GetIndexSize(void) const;
		/*************************************************************************//*!
				@brief			インデックス数取得
				@param			None

				@return			インデックス数の取得
		*//**************************************************************************/
		virtual MofU32 GetIndexCount(void) const;
	};

	#include	"IndexBufferBase.inl"
}

#endif

//[EOF]