/*************************************************************************//*!
					
					@file	MeshCameraBase.h
					@brief	メッシュカメラ基底クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__MESHCAMERABASE__H__

#define		__MESHCAMERABASE__H__

//INCLUDE
#include	"MeshCamera.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュコンテナインターフェイス

			メッシュコンテナインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CMeshCamera : public IMeshCamera {
	private:
		/*******************//*!
		名前
		*//********************/
		CString							m_Name;
		/*******************//*!
		設定
		*//********************/
		MOMCAMERAINFO					m_Info;
		/*******************//*!
		アニメーション
		*//********************/
		LPMeshCameraAnimationArray		m_pAnimation;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CMeshCamera();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーメッシュアニメーション

				@return			None
		*//**************************************************************************/
		CMeshCamera(const CMeshCamera& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CMeshCamera();
		
		/*************************************************************************//*!
				@brief			メッシュアニメーションのコピー生成
				@param			None
				
				@return			作成されたコピーCMeshCamera<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IMeshCamera* CreateCopyObject(void) const;
		
		/*************************************************************************//*!
				@brief			カメラ状態の計算
				@param[in]		pCam		適用カメラ

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool CalculateCamera(LPCamera pCam);
		/*************************************************************************//*!
				@brief			カメラ状態の計算
				@param[in]		pCam		適用カメラ
				@param[in]		t			アニメーション時間
				@param[in]		bLoop		ループ
				@param[in]		pAnim		アニメーション名
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool CalculateCamera(LPCamera pCam, MofFloat t, MofBool bLoop, LPCMofChar pAnim);
		
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);
		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			カメラ情報取得
				@param			None

				@return			カメラ情報
		*//**************************************************************************/
		virtual MOMCAMERAINFO& GetInfo(void);
		/*************************************************************************//*!
				@brief			アニメーションの取得
				@param			None

				@return			アニメーション配列
		*//**************************************************************************/
		virtual LPMeshCameraAnimationArray GetAnimation(void);
		/*************************************************************************//*!
				@brief			登録されていアニメーション取得
				@param[in]		pName			アニメーション名

				@return			アニメーション
		*//**************************************************************************/
		virtual LPMeshCameraAnimation GetAnimation(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			アニメーション登録数取得
				@param			None

				@return			アニメーション登録数
		*//**************************************************************************/
		virtual MofU32 GetAnimationCount(void);

		//クラス基本定義
		MOF_LIBRARYCLASS(CMeshCamera, MOF_MESHCAMERACLASS_ID);
	};
	
#include	"MeshCameraBase.inl"
}

#endif	//__MESHCAMERABASE__H__

//[EOF]