/*************************************************************************//*!
					
					@file	MeshBoneAnimation.h
					@brief	メッシュアニメーション基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__MESHBONEANIMATION__H__

#define		__MESHBONEANIMATION__H__

//INCLUDE
#include	"Bone.h"
#include	"../Common/KeyFrameArray.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュアニメーションインターフェイス

			メッシュアニメーションインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IMeshBoneAnimation : public IMofNamedObject , public IMofCopyObject< IMeshBoneAnimation > {
	private:
	public:
		//----------------------------------------------------------------------------
		////Is
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			ループフラグがあるかを判定する
				@param			None
				
				@return			TRUE			ループする<br>
								FALSE			ループしない
		*//**************************************************************************/
		virtual MofBool IsLoop(void) = 0;

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			モーションのフラグの設定
				@param[in]		f				フラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetFlag(MofU32 f) = 0;
		/*************************************************************************//*!
				@brief			座標キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetPositionKey(LPVector3KeyFrameArray pKey) = 0;
		/*************************************************************************//*!
				@brief			拡大キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetScalingKey(LPVector3KeyFrameArray pKey) = 0;
		/*************************************************************************//*!
				@brief			回転キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetRotationKey(LPQuaternionKeyFrameArray pKey) = 0;
		/*************************************************************************//*!
				@brief			モーションのループフラグの設定
				@param[in]		bLoop			ループフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetLoop(MofBool bLoop) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			アニメーションの時間取得
				@param			None

				@return			アニメーションの時間
		*//**************************************************************************/
		virtual MofFloat GetTime(void) = 0;
		/*************************************************************************//*!
				@brief			アニメーションのフラグ取得
				@param			None

				@return			アニメーションのフラグ
		*//**************************************************************************/
		virtual MofU32 GetFlag(void) = 0;
		/*************************************************************************//*!
				@brief			座標キー取得
				@param			None

				@return			座標キー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetPositionKey(void) = 0;
		/*************************************************************************//*!
				@brief			拡大キー取得
				@param			None

				@return			拡大キー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetScalingKey(void) = 0;
		/*************************************************************************//*!
				@brief			回転キー取得
				@param			None

				@return			回転キー
		*//**************************************************************************/
		virtual LPQuaternionKeyFrameArray GetRotationKey(void) = 0;
	};
	
	//ポインタ置き換え
	typedef IMeshBoneAnimation*				LPMeshBoneAnimation;
	typedef CDynamicArray< LPMeshBoneAnimation >		CMeshBoneAnimationArray,*LPMeshBoneAnimationArray;
}

#endif	//__MESHBONEANIMATION__H__

//[EOF]