/*************************************************************************//*!
					
					@file	MeshCameraAnimationBase.h
					@brief	メッシュアニメーション基底クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__MESHCAMERAANIMATIONBASE__H__

#define		__MESHCAMERAANIMATIONBASE__H__

//INCLUDE
#include	"MeshCameraAnimation.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュアニメーション基底クラス

			メッシュアニメーション基底となるクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CMeshCameraAnimation : public IMeshCameraAnimation {
	protected:
		/*******************//*!
		名前
		*//********************/
		CString						m_Name;
		/*******************//*!
		座標キー
		*//********************/
		LPVector3KeyFrameArray		m_pPositionKey;
		/*******************//*!
		ターゲット座標キー
		*//********************/
		LPVector3KeyFrameArray		m_pTargetKey;
		/*******************//*!
		上方座標キー
		*//********************/
		LPVector3KeyFrameArray		m_pUpKey;
		/*******************//*!
		視野角キー
		*//********************/
		LPFloatKeyFrameArray		m_pFovKey;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CMeshCameraAnimation();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーメッシュアニメーション

				@return			None
		*//**************************************************************************/
		CMeshCameraAnimation(const CMeshCameraAnimation& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CMeshCameraAnimation();
		
		/*************************************************************************//*!
				@brief			メッシュアニメーションのコピー生成
				@param			None
				
				@return			作成されたコピーCMeshCameraAnimation<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IMeshCameraAnimation* CreateCopyObject(void) const;

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			座標キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetPositionKey(LPVector3KeyFrameArray pKey);
		/*************************************************************************//*!
				@brief			ターゲットキー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetTargetKey(LPVector3KeyFrameArray pKey);
		/*************************************************************************//*!
				@brief			上方キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetUpKey(LPVector3KeyFrameArray pKey);
		/*************************************************************************//*!
				@brief			視野角キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetFovKey(LPFloatKeyFrameArray pKey);
		/*************************************************************************//*!
				@brief			モーションのループフラグの設定
				@param[in]		bLoop			ループフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetLoop(MofBool bLoop);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			アニメーションの時間取得
				@param			None

				@return			アニメーションの時間
		*//**************************************************************************/
		virtual MofFloat GetTime(void);
		/*************************************************************************//*!
				@brief			座標キー取得
				@param			None

				@return			座標キー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetPositionKey(void);
		/*************************************************************************//*!
				@brief			ターゲットキー取得
				@param			None

				@return			ターゲットキー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetTargetKey(void);
		/*************************************************************************//*!
				@brief			上方キー取得
				@param			None

				@return			上方キー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetUpKey(void);
		/*************************************************************************//*!
				@brief			視野角キー取得
				@param			None

				@return			視野角キー
		*//**************************************************************************/
		virtual LPFloatKeyFrameArray GetFovKey(void);

		//クラス基本定義
		MOF_LIBRARYCLASS(CMeshCameraAnimation,MOF_MESHCAMERAANIMATIONCLASS_ID);
	};

	#include	"MeshCameraAnimationBase.inl"

}

#endif

//[EOF]