/*************************************************************************//*!
					
					@file	MeshCameraAnimation.h
					@brief	メッシュアニメーション基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__MESHCAMERAANIMATION__H__

#define		__MESHCAMERAANIMATION__H__

//INCLUDE
#include	"Bone.h"
#include	"../Common/KeyFrameArray.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュアニメーションインターフェイス

			メッシュアニメーションインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IMeshCameraAnimation : public IMofNamedObject , public IMofCopyObject< IMeshCameraAnimation > {
	private:
	public:
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			座標キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetPositionKey(LPVector3KeyFrameArray pKey) = 0;
		/*************************************************************************//*!
				@brief			ターゲットキー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetTargetKey(LPVector3KeyFrameArray pKey) = 0;
		/*************************************************************************//*!
				@brief			上方キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetUpKey(LPVector3KeyFrameArray pKey) = 0;
		/*************************************************************************//*!
				@brief			視野角キー設定<br>
								古いデータがある場合解放される
				@param[in]		pKey			設定するキー
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetFovKey(LPFloatKeyFrameArray pKey) = 0;
		/*************************************************************************//*!
				@brief			モーションのループフラグの設定
				@param[in]		bLoop			ループフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetLoop(MofBool bLoop) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			アニメーションの時間取得
				@param			None

				@return			アニメーションの時間
		*//**************************************************************************/
		virtual MofFloat GetTime(void) = 0;
		/*************************************************************************//*!
				@brief			座標キー取得
				@param			None

				@return			座標キー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetPositionKey(void) = 0;
		/*************************************************************************//*!
				@brief			ターゲットキー取得
				@param			None

				@return			ターゲットキー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetTargetKey(void) = 0;
		/*************************************************************************//*!
				@brief			上方キー取得
				@param			None

				@return			上方キー
		*//**************************************************************************/
		virtual LPVector3KeyFrameArray GetUpKey(void) = 0;
		/*************************************************************************//*!
				@brief			視野角キー取得
				@param			None

				@return			視野角キー
		*//**************************************************************************/
		virtual LPFloatKeyFrameArray GetFovKey(void) = 0;
	};
	
	//ポインタ置き換え
	typedef IMeshCameraAnimation*				LPMeshCameraAnimation;
	typedef CDynamicArray< LPMeshCameraAnimation >		CMeshCameraAnimationArray,*LPMeshCameraAnimationArray;
}

#endif	//__MESHCAMERAANIMATION__H__

//[EOF]