/*************************************************************************//*!
					
					@file	MeshAnimationBase.h
					@brief	メッシュアニメーション基底クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__MESHANIMATIONBASE__H__

#define		__MESHANIMATIONBASE__H__

//INCLUDE
#include	"MeshAnimation.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュアニメーション基底クラス

			メッシュアニメーション基底となるクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CMeshAnimation : public IMeshAnimation {
	protected:
		/*******************//*!
		名前
		*//********************/
		CString							m_Name;
		/*******************//*!
		ボーンアニメーション
		*//********************/
		LPMeshBoneAnimationArray		m_pBoneAnimation;
		/*******************//*!
		モーフィングアニメーション
		*//********************/
		LPMeshMorphingAnimationArray	m_pMorphingAnimation;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CMeshAnimation();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーメッシュアニメーション

				@return			None
		*//**************************************************************************/
		CMeshAnimation(const CMeshAnimation& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CMeshAnimation();
		
		/*************************************************************************//*!
				@brief			メッシュアニメーションのコピー生成
				@param			None
				
				@return			作成されたコピーCMeshAnimation<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IMeshAnimation* CreateCopyObject(void) const;

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			モーションのループフラグの設定
				@param[in]		bLoop			ループフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetLoop(MofBool bLoop);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			アニメーションでの動作ボーン情報取得
				@param			None

				@return			アニメーションでの動作ボーン情報配列
		*//**************************************************************************/
		virtual LPMeshBoneAnimationArray GetBoneAnimation(void);
		/*************************************************************************//*!
				@brief			アニメーションでの動作モーフィング情報取得
				@param			None

				@return			アニメーションでの動作モーフィング情報配列
		*//**************************************************************************/
		virtual LPMeshMorphingAnimationArray GetMorphingAnimation(void);
		/*************************************************************************//*!
				@brief			アニメーションの時間取得
				@param			None

				@return			アニメーションの時間
		*//**************************************************************************/
		virtual MofFloat GetTime(void);

		//クラス基本定義
		MOF_LIBRARYCLASS(CMeshAnimation,MOF_MESHANIMATIONCLASS_ID);
	};

	#include	"MeshAnimationBase.inl"

}

#endif

//[EOF]