/*************************************************************************//*!
					
					@file	MotionController.h
					@brief	モーション管理基底インターフェイス。<br>
							メッシュアニメーションやスプライトアニメーションの時間と状態を管理する。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__MOTIONCONTROLLER__H__

#define		__MOTIONCONTROLLER__H__

//INCLUDE
#include	"Graphics.h"

namespace Mof {
	
	/*******************************//*!
	@brief	アニメーションロック列挙

			アニメーションロックの列挙

	@author	CDW
	*//********************************/
	typedef enum MotionLock {
		MOTIONLOCK_OFF,
		MOTIONLOCK_ON,
		MOTIONLOCK_DISABLE,
		MOTIONLOCK_DISABLEON,
	}MotionLock;

	/*******************************//*!
	@brief	モーション管理基底インターフェイス

			モーション管理基底インターフェイス。<br>
			メッシュアニメーションやスプライトアニメーションの時間と状態を管理する。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IMotionController : public IMofObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			現在の状態を更新
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Refresh(void) = 0;
		/*************************************************************************//*!
				@brief			現在のモーション状態を更新
				@param[in]		t			更新時間
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool AddTimer(MofFloat t) = 0;

		/*************************************************************************//*!
				@brief			現在のモーションを変更
				@param[in]		n			モーション番号
				@param[in]		bSame		同一モーションでの更新フラグ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool ChangeMotion(MofU32 n,MofBool bSame = TRUE) = 0;
		/*************************************************************************//*!
				@brief			現在のモーションを変更
				@param[in]		str			モーション名
				@param[in]		bSame		同一モーションでの更新フラグ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool ChangeMotionByName(LPCMofChar str,MofBool bSame = TRUE) = 0;
		
		//----------------------------------------------------------------------------
		////Is
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			現在のモーションが終了しているかを判定する。<br>
								モーションがループする場合はTRUEになることはない
				@param			None
				
				@return			TRUE		終了済み<br>
								FALE		まだ終了していない
		*//**************************************************************************/
		virtual MofBool IsEndMotion(void) = 0;

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			現在のモーション時間を設定
				@param[in]		t			設定時間
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetTime(MofFloat t) = 0;
		/*************************************************************************//*!
				@brief			モーションのループフラグの設定
				@param[in]		n				モーション番号
				@param[in]		bLoop			ループフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetMotionLoop(MofU32 n,MofBool bLoop) = 0;
		/*************************************************************************//*!
				@brief			モーションのループフラグの設定
				@param[in]		str				モーション名
				@param[in]		bLoop			ループフラグ
				
				@return			TRUE			成功<br>
								それ以外		失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetMotionLoopByName(LPCMofChar str,MofBool bLoop) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			現在のモーション時間取得
				@param			None

				@return			現在のモーション時間
		*//**************************************************************************/
		virtual MofFloat GetTime(void) const = 0;
		/*************************************************************************//*!
				@brief			現在のモーション番号取得
				@param			None

				@return			現在のモーション番号
		*//**************************************************************************/
		virtual MofS32 GetMotionNo(void) const = 0;
		/*************************************************************************//*!
				@brief			登録されているモーション数取得
				@param			None

				@return			登録されているモーション数
		*//**************************************************************************/
		virtual MofS32 GetMotionCount(void) const = 0;
	};
}

#endif

//[EOF]