/*************************************************************************//*!
					
					@file	RenderTarget.h
					@brief	描画ターゲット基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__RENDERTARGET__H__

#define		__RENDERTARGET__H__

//INCLUDE
#include	"Graphics.h"

namespace Mof {
	
	/*******************************//*!
	@brief	描画ターゲット基底インターフェイス

			描画ターゲットの基底となるインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IRenderTarget : public IMofObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			描画ターゲットの生成
				@param[in]		pGraphics	グラフィックスインターフェイス
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPGraphics pGraphics) = 0;
		
		/*************************************************************************//*!
				@brief			描画ターゲットの生成
				@param[in]		pRenderTarget	描画ターゲット
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(MofRenderTarget pRenderTarget) = 0;
										
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			クリアカラー設定
				@param[in]		Color	クリアカラー

				@return			None
		*//**************************************************************************/
		virtual void SetClearColor(Vector4& Color) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			描画ターゲット取得
				@param			None

				@return			描画ターゲット
		*//**************************************************************************/
		virtual MofRenderTarget GetTarget(void) = 0;
		/*************************************************************************//*!
				@brief			クリアカラー取得
				@param			None

				@return			クリアカラー
		*//**************************************************************************/
		virtual const Vector4& GetClearColor(void)const = 0;
	};

	//ポインタ置き換え
	typedef IRenderTarget*		LPRenderTarget;
}

#endif

//[EOF]