/*************************************************************************//*!
					
					@file	ShaderResource.h
					@brief	シェーダー基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SHADERRESOURCE__H__

#define		__SHADERRESOURCE__H__

//INCLUDE
#include	"Shader.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シェーダーインターフェイス

			シェーダーへのパラメーター設定をおこなうためのバッファインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IShaderResource : public IMofNamedObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			バッファの生成
				@param[in]		pShader		シェーダー
				@param[in]		pName		リソース名
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPShader pShader, LPCMofChar pName) = 0;
		
		/*************************************************************************//*!
				@brief			バインドの実行
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Bind(void) = 0;

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			リソースの設定
				@param[in]		pTex		データ
					
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetResource(LPTexture pTex) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
	};

	//ポインタ置き換え
	typedef IShaderResource*			LPShaderResource;
	typedef CDynamicArray< LPShaderResource > CShaderResourceArray, *LPShaderResourceArray;
}

#endif

//[EOF]