/*************************************************************************//*!
					
					@file	ShaderEffect_EdgeMaskOutput.h
					@brief	マルチレンダリングによる深度＆法線テクスチャ描画シェーダークラス。

															@author	CDW
															@date	2015.11.02
*//**************************************************************************/

//ONCE
#ifndef		__SHADEREFFECT_EDGEMASKOUTPUT__H__

#define		__SHADEREFFECT_EDGEMASKOUTPUT__H__

//INCLUDE
#include	"ShaderEffect_3DBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	マルチレンダリングによる深度テクスチャ描画シェーダークラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CShaderEffect_EdgeMaskOutput : public CShaderEffect_3DBase {
	protected:
		/*******************//*!
		エッジ描画対象のマスクテクスチャ
		*//********************/
		LPTexture m_pMaskTex;
		/*******************//*!
		深度テクスチャ描画用深度バッファ
		*//********************/
		LPDepthTarget m_pDepthTarget;

		LPRenderTarget m_pOrigRenderTarget;	//<!退避
		LPDepthTarget m_pOrigDepthTarget;	//<!退避
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CShaderEffect_EdgeMaskOutput();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CShaderEffect_EdgeMaskOutput();
		
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create();
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param[in]		DepthFormat		深度バッファフォーマット
				@param[in]		MultiRender		マルチレンダリングフラグ

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(PixelFormat DepthFormat,MofBool MultiRender);
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		/*************************************************************************//*!
				@brief			開始
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Begin();
		/*************************************************************************//*!
				@brief			終了
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool End();

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			マスク値設定
				@param[in]		Mask			マスク値
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetMaskValue(MofFloat Mask);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			テクスチャの取得
				@param[in]		n			番号
					
				@return			テクスチャ
		*//**************************************************************************/
		virtual LPTexture GetTexture(MofU32 n);
		/*************************************************************************//*!
				@brief			マスクテクスチャの取得
				@param			None
				
				@return			マスクテクスチャ
		*//**************************************************************************/
		virtual LPTexture GetMaskTexture();

		//クラス基本定義
		MOF_LIBRARYCLASS(CShaderEffect_EdgeMaskOutput,MOF_SHADEREFFECTEDGEMASKOUTPUTCLASS_ID);
	};

	// 置き換え
	typedef CShaderEffect_EdgeMaskOutput*			LPShaderEffect_EdgeMaskOutput;

#include	"ShaderEffect_EdgeMaskOutput.inl"

}

#endif

//[EOF]