/*************************************************************************//*!
					
					@file	ShaderEffect_3DBase.h
					@brief	3D用シェーダー効果基底クラス。

															@author	CDW
															@date	2015.05.01
*//**************************************************************************/

//ONCE
#ifndef		__SHADEREFFECT_3DBASE__H__

#define		__SHADEREFFECT_3DBASE__H__

//INCLUDE
#include	"ShaderEffect.h"
#include	"ShaderBindBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	3D用シェーダー効果基底クラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CShaderEffect_3DBase : public IShaderEffect {
	protected:
		/*******************//*!
		3Dプリミティブ描画用シェーダー
		*//********************/
		LPShader		m_p3DPrimitiveShader;
		/*******************//*!
		3Dプリミティブ描画用バインド
		*//********************/
		LPShaderBind	m_p3DPrimitiveBind;
		/*******************//*!
		3Dスキニング描画用シェーダー
		*//********************/
		LPShader		m_pSkinGeometryShader;
		/*******************//*!
		3Dスキニング描画用バインド
		*//********************/
		LPShaderBind	m_pSkinGeometryBind;

		
		LPShader		m_pOrig3DPrimitiveShader;	//<! 退避用変数
		LPShaderBind	m_pOrig3DPrimitiveBind;		//<! 退避用変数
		LPShader		m_pOrigSkinGeometryShader;	//<! 退避用変数
		LPShaderBind	m_pOrigSkinGeometryBind;	//<! 退避用変数
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CShaderEffect_3DBase();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CShaderEffect_3DBase();
		
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		/*************************************************************************//*!
				@brief			開始
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Begin();
		/*************************************************************************//*!
				@brief			終了
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool End();

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			3Dプリミティブ描画用シェーダーを取得する
				@param			None

				@return			3Dプリミティブ描画用シェーダー
		*//**************************************************************************/
		virtual LPShader GetShader(void);
		/*************************************************************************//*!
				@brief			3Dプリミティブ描画用シェーダーを取得する
				@param			None

				@return			3Dプリミティブ描画用シェーダー
		*//**************************************************************************/
		virtual LPShaderBind GetShaderBind(void);
		/*************************************************************************//*!
				@brief			3Dスキニング描画用シェーダーを取得する
				@param			None

				@return			3Dスキニング描画用シェーダー
		*//**************************************************************************/
		virtual LPShader Get3DPrimitiveShader(void);
		/*************************************************************************//*!
				@brief			3Dスキニング描画用シェーダーを取得する
				@param			None

				@return			3Dスキニング描画用シェーダー
		*//**************************************************************************/
		virtual LPShaderBind Get3DPrimitiveBind(void);
		/*************************************************************************//*!
				@brief			3Dスキニング描画用シェーダーを取得する
				@param			None

				@return			3Dスキニング描画用シェーダー
		*//**************************************************************************/
		virtual LPShader GetSkinGeometryShader(void);
		/*************************************************************************//*!
				@brief			3Dスキニング描画用シェーダーを取得する
				@param			None

				@return			3Dスキニング描画用シェーダー
		*//**************************************************************************/
		virtual LPShaderBind GetSkinGeometryBind(void);
		/*************************************************************************//*!
				@brief			テクスチャの取得
				@param[in]		n			番号
					
				@return			テクスチャ
		*//**************************************************************************/
		virtual LPTexture GetTexture(MofU32 n);

	};

	// 置き換え
	typedef CShaderEffect_3DBase*			LPShaderEffect_3DBase;

#include	"ShaderEffect_3DBase.inl"

}

#endif

//[EOF]