/*************************************************************************//*!
					
					@file	ShaderPassBase.h
					@brief	シェーダーパス基底クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SHADERPASSBASE__H__

#define		__SHADERPASSBASE__H__


//INCLUDE
#include	"ShaderPass.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シェーダーパスクラス

			シェーダーのパス設定を行うためのクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CShaderPassBase : public IShaderPass {
	protected:
		/*******************//*!
		名前
		*//********************/
		CString						m_Name;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CShaderPassBase();
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pName		パス名
				@param[in]		pc			パスカウント

				@return			None
		*//**************************************************************************/
		CShaderPassBase(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーシェーダー

				@return			None
		*//**************************************************************************/
		CShaderPassBase(const CShaderPassBase& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CShaderPassBase();
		
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
	};

	#include	"ShaderPassBase.inl"

}

#endif

//[EOF]