/*************************************************************************//*!
					
					@file	ShaderEffect_BumpMapping.h
					@brief	バンプマッピングシェーダークラス。

															@author	CDW
															@date	2015.06.19
*//**************************************************************************/

//ONCE
#ifndef		__SHADEREFFECT_BUMPMAPPING__H__

#define		__SHADEREFFECT_BUMPMAPPING__H__

//INCLUDE
#include	"ShaderEffect_3DBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	バンプマッピングシェーダークラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CShaderEffect_BumpMapping : public CShaderEffect_3DBase {
	protected:
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CShaderEffect_BumpMapping();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CShaderEffect_BumpMapping();
		
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create();
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		/*************************************************************************//*!
				@brief			開始
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Begin();
		/*************************************************************************//*!
				@brief			終了
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool End();

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------

		//クラス基本定義
		MOF_LIBRARYCLASS(CShaderEffect_BumpMapping,MOF_SHADEREFFECTBUMPMAPPINGCLASS_ID);
	};

	// 置き換え
	typedef CShaderEffect_BumpMapping*			LPShaderEffect_BumpMapping;

#include	"ShaderEffect_BumpMapping.inl"

}

#endif

//[EOF]