/*************************************************************************//*!
					
					@file	ShaderEffect_ShadowRenderer.h
					@brief	シャドウマップによる影描画シェーダークラス。

															@author	CDW
															@date	2015.05.04
*//**************************************************************************/

//ONCE
#ifndef		__SHADEREFFECT_SHADOWRENDERER__H__

#define		__SHADEREFFECT_SHADOWRENDERER__H__

//INCLUDE
#include	"ShaderEffect_ShadowTexture.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シャドウマップによる影描画シェーダークラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CShaderEffect_ShadowRenderer : public CShaderEffect_3DBase {
	protected:
		/*******************//*!
		影をずらす量
		*//********************/
		MofFloat	m_ShadowEpsilon;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CShaderEffect_ShadowRenderer();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CShaderEffect_ShadowRenderer();
		
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create();
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		/*************************************************************************//*!
				@brief			開始
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Begin();
		/*************************************************************************//*!
				@brief			終了
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool End();

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			シャドウマップのセット
				@param[in]		pShadowMap
				
				@return			None
		*//**************************************************************************/
		virtual void SetShadowMap(LPShaderEffect_ShadowTexture pShadowMap);
		/*************************************************************************//*!
				@brief			イプシロンの設定
				@param[in]		Epsilon			影をずらす量
				
				@return			None
		*//**************************************************************************/
		virtual void SetEpsilon(MofFloat Epsilon);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------

		//クラス基本定義
		MOF_LIBRARYCLASS(CShaderEffect_ShadowRenderer,MOF_SHADEREFFECTSHADOWRENDERERCLASS_ID);
	};

	// 置き換え
	typedef CShaderEffect_ShadowRenderer*			LPShaderEffect_ShadowRenderer;

#include	"ShaderEffect_ShadowRenderer.inl"

}

#endif

//[EOF]