/*************************************************************************//*!
					
					@file	ShaderEffect_ShadowMap.h
					@brief	シャドウマップシェーダークラス。

															@author	CDW
															@date	2015.05.13
*//**************************************************************************/

//ONCE
#ifndef		__SHADEREFFECT_SHADOWMAP__H__

#define		__SHADEREFFECT_SHADOWMAP__H__

//INCLUDE
#include	"ShaderEffect_ShadowRenderer.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シャドウマップシェーダークラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CShaderEffect_ShadowMap : public IShaderEffect {
	protected:
		/*******************//*!
		シャドウマップ用深度テクスチャ描画シェーダー
		*//********************/
		LPShaderEffect_ShadowTexture m_pShadowTexture;
		/*******************//*!
		シャドウマップによる影描画シェーダー
		*//********************/
		LPShaderEffect_ShadowRenderer m_pShadowRenderer;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CShaderEffect_ShadowMap();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CShaderEffect_ShadowMap();
		
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create();
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param[in]		TexSize シャドウマップ用テクスチャサイズ

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(MofU32 TexSize);
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param[in]		TexSize シャドウマップ用テクスチャサイズ
				@param[in]		TexFormat シャドウマップ用テクスチャフォーマット

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(MofU32 TexSize, PixelFormat TexFormat);
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		/*************************************************************************//*!
				@brief			深度テクスチャ作成開始
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool BeginTexture();
		/*************************************************************************//*!
				@brief			深度テクスチャ作成終了
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool EndTexture();
		/*************************************************************************//*!
				@brief			影を適用した画面描画開始
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool BeginRenderer();
		/*************************************************************************//*!
				@brief			影を適用した画面描画終了
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool EndRenderer();

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			シャドウマップの範囲を設定
				@param[in]		Range		シャドウマップに描画する範囲
				@param[in]		Near		シャドウマップに描画する最少距離
				@param[in]		Far			シャドウマップに描画する最大距離
				@param[in]		Epsilon		影をずらす量
					
				@return			None
		*//**************************************************************************/
		virtual void SetShadowMapParam(MofFloat Range,MofFloat Near,MofFloat Far,MofFloat Epsilon);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			シェーダーの取得
				@param			None
				
				@return			シェーダーを返す。
								失敗の場合NULLになる。
		*//**************************************************************************/
		virtual LPShader GetShader(void);
		/*************************************************************************//*!
				@brief			シェーダーバインドの取得
				@param			None
				
				@return			シェーダーバインドを返す。
								失敗の場合NULLになる。
		*//**************************************************************************/
		virtual LPShaderBind GetShaderBind(void);
		/*************************************************************************//*!
				@brief			深度テクスチャの取得
				@param			None
				
				@return			深度テクスチャ
		*//**************************************************************************/
		virtual LPTexture GetShadowMapTexture();

		//クラス基本定義
		MOF_LIBRARYCLASS(CShaderEffect_ShadowMap,MOF_SHADEREFFECTSHADOWMAPCLASS_ID);
	};

	// 置き換え
	typedef CShaderEffect_ShadowMap*			LPShaderEffect_ShadowMap;

#include	"ShaderEffect_ShadowMap.inl"

}

#endif

//[EOF]