/*************************************************************************//*!
					
					@file	ShaderEffect.h
					@brief	シェーダーエフェクトの基底インターフェイス。
							シェーダーとバインドをセットにして扱いやすくするクラス。

															@author	CDW
															@date	2015.04.17
*//**************************************************************************/

//ONCE
#ifndef		__SHADEREFFECT__H__

#define		__SHADEREFFECT__H__

//INCLUDE
#include "Shader.h"
#include "ShaderBindBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シェーダーエフェクトの基底インターフェイス。

			シェーダーとバインドをセットにして扱いやすくするクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IShaderEffect : public IMofObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			シェーダーエフェクトの作成。
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create() = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			シェーダーの取得
				@param			None
				
				@return			シェーダーを返す。
								失敗の場合NULLになる。
		*//**************************************************************************/
		virtual LPShader GetShader(void) = 0;
		/*************************************************************************//*!
				@brief			シェーダーバインドの取得
				@param			None
				
				@return			シェーダーバインドを返す。
								失敗の場合NULLになる。
		*//**************************************************************************/
		virtual LPShaderBind GetShaderBind(void) = 0;
	};

	//ポインタ置き換え
	typedef IShaderEffect*		LPShaderEffect;
}

#endif

//[EOF]