/*************************************************************************//*!
					
					@file	ShaderBuffer.h
					@brief	シェーダー基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SHADERBUFFER__H__

#define		__SHADERBUFFER__H__

//INCLUDE
#include	"Shader.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シェーダーインターフェイス

			シェーダーへのパラメーター設定をおこなうためのバッファインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IShaderBuffer : public IMofNamedObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			バッファの生成
				@param[in]		pShader		シェーダー
				@param[in]		pName		バッファ名
				@param[in]		size		バッファサイズ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPShader pShader, LPCMofChar pName,const MofU32 size) = 0;
		
		/*************************************************************************//*!
				@brief			バインドの実行
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Bind(void) = 0;

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			バッファの設定
				@param[in]		pData		データ
					
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetBuffer(LPMofVoid pData) = 0;
		/*************************************************************************//*!
				@brief			バッファの設定
				@param[in]		pData		データ
				@param[in]		off			オフセット
				@param[in]		s			サイズ
					
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetBuffer(LPMofVoid pData,MofU32 off,MofU32 s) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			バッファサイズ取得
				@param			None

				@return			バッファサイズ
		*//**************************************************************************/
		virtual MofU32 GetBufferSize(void) const = 0;
	};

	//ポインタ置き換え
	typedef IShaderBuffer*			LPShaderBuffer;
	typedef CDynamicArray< LPShaderBuffer > CShaderBufferArray, *LPShaderBufferArray;
}

#endif

//[EOF]