/*************************************************************************//*!
					
					@file	ShaderBufferBase.h
					@brief	シェーダーバッファクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SHADERBUFFERBASE__H__

#define		__SHADERBUFFERBASE__H__

//INCLUDE
#include	"ShaderBuffer.h"

namespace Mof {
	
	/*******************************//*!
	@brief	シェーダーインターフェイス

			シェーダーへのパラメーター設定をおこなうためのバッファインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CShaderBufferBase : public IShaderBuffer {
	protected:
		/*******************//*!
		名前
		*//********************/
		CString						m_Name;
		/*******************//*!
		バッファサイズ
		*//********************/
		MofU32						m_Size;
		/*******************//*!
		バッファ
		*//********************/
		LPMofVoid					m_pBuffer;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CShaderBufferBase();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーシェーダー

				@return			None
		*//**************************************************************************/
		CShaderBufferBase(const CShaderBufferBase& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CShaderBufferBase();
		
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			バッファサイズ取得
				@param			None

				@return			バッファサイズ
		*//**************************************************************************/
		virtual MofU32 GetBufferSize(void) const;
	};

	#include	"ShaderBufferBase.inl"
}

#endif

//[EOF]