/*************************************************************************//*!
					
					@file	Sprite3D.h
					@brief	3Dスプライトクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SPRITE3D__H__

#define		__SPRITE3D__H__

//INCLUDE
#include	"SpriteBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	3Dスプライトクラス

			3Dスプライトクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CSprite3D : public CSpriteBase {
		//----------------------------------------------------------------------------
		////前ライブラリとの対応のためにも一般パラメーターをpublic対応にしておく
		//----------------------------------------------------------------------------
	public:
		/*******************//*!
		比率維持フラグ
		*//********************/
		MofBool							m_bRatio;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CSprite3D();
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pName		テクスチャファイル名

				@return			None
		*//**************************************************************************/
		CSprite3D(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pTex		テクスチャ

				@return			None
		*//**************************************************************************/
		CSprite3D(LPTexture pTex);
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pName		スプライト名
				@param[in]		pTex		テクスチャ

				@return			None
		*//**************************************************************************/
		CSprite3D(LPCMofChar pName,LPTexture pTex);
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーテクスチャ

				@return			None
		*//**************************************************************************/
		CSprite3D(const CSprite3D& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CSprite3D();
		
		/*************************************************************************//*!
				@brief			テクスチャのコピー生成
				@param			None
				
				@return			作成されたコピーテクスチャ<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual ISprite* CreateCopyObject(void) const;

		/*************************************************************************//*!
				@brief			スプライトの更新
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Update(void);

		/*************************************************************************//*!
				@brief			スプライトの描画
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(void);
		
		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			幅取得
				@param			None

				@return			画像の幅
		*//**************************************************************************/
		virtual MofFloat GetWidth(void);
		/*************************************************************************//*!
				@brief			高さ取得
				@param			None

				@return			画像の高さ
		*//**************************************************************************/
		virtual MofFloat GetHeight(void);

		//クラス基本定義
		MOF_LIBRARYCLASS(CSprite3D,MOF_SPRITE3DCLASS_ID);
	};

	#include	"Sprite3D.inl"

	//ポインタ置き換え
	typedef CSprite3D*			LPSprite3D;
}

#endif

//[EOF]