/*************************************************************************//*!
					
					@file	SpriteBase.h
					@brief	スプライト基底クラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SPRITEBASE__H__

#define		__SPRITEBASE__H__

//INCLUDE
#include	"Sprite.h"

namespace Mof {
	
	/*******************************//*!
	@brief	スプライト基底クラス

			スプライト基底となるクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CSpriteBase : public ISprite {
		//----------------------------------------------------------------------------
		////前ライブラリとの対応のためにも一般パラメーターをpublic対応にしておく
		//----------------------------------------------------------------------------
	public:
		/*******************//*!
		名前
		*//********************/
		CString						m_Name;
		/*******************//*!
		テクスチャ
		*//********************/
		LPTexture					m_pTexture;
		/*******************//*!
		座標
		*//********************/
		CVector3					m_Position;
		/*******************//*!
		拡大
		*//********************/
		CVector3					m_Scale;
		/*******************//*!
		回転角度
		*//********************/
		CVector3					m_Angle;
		/*******************//*!
		色
		*//********************/
		CVector4					m_Color;
		/*******************//*!
		画像矩形
		*//********************/
		CRectangle					m_ImageRect;
		/*******************//*!
		アライメント
		*//********************/
		TextureAlignment			m_Alignment;
		/*******************//*!
		アライメント座標<br>
		m_AlignmentメンバがTEXTUREALIGNMENT_USERを使用している場合のみ参照される。
		*//********************/
		CVector2					m_AlignmentPosition;
		/*******************//*!
		反転フラグ
		*//********************/
		TextureReverse				m_Reverse;
		/*******************//*!
		ブレンド
		*//********************/
		Blending					m_Blending;
		/*******************//*!
		ワールドマトリクス
		*//********************/
		CMatrix44					m_World;
		/*******************//*!
		表示フラグ
		*//********************/
		MofBool						m_bShow;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CSpriteBase();
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pName		テクスチャファイル名

				@return			None
		*//**************************************************************************/
		CSpriteBase(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pTex		テクスチャ

				@return			None
		*//**************************************************************************/
		CSpriteBase(LPTexture pTex);
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param[in]		pName		スプライト名
				@param[in]		pTex		テクスチャ

				@return			None
		*//**************************************************************************/
		CSpriteBase(LPCMofChar pName,LPTexture pTex);
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピーテクスチャ

				@return			None
		*//**************************************************************************/
		CSpriteBase(const CSpriteBase& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CSpriteBase();
		
		/*************************************************************************//*!
				@brief			スプライトの作成
				@param[in]		pName		画像ファイル名

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool CreateSprite(LPCMofChar pName);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);
		/*************************************************************************//*!
				@brief			テクスチャ設定
				@param[in]		pTex			設定するテクスチャ
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetTexture(LPTexture pTex);
		/*************************************************************************//*!
				@brief			画像矩形設定
				@param[in]		l			左
				@param[in]		t			上
				@param[in]		r			右
				@param[in]		b			下
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetImageRect(MofFloat l,MofFloat t,MofFloat r,MofFloat b);
		/*************************************************************************//*!
				@brief			画像矩形設定
				@param[in]		r			矩形
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetImageRect(const Rectangle& r);
		/*************************************************************************//*!
				@brief			アルファ値設定
				@param[in]		a			アルファ値
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetAlpha(MofFloat a);
		/*************************************************************************//*!
				@brief			反転フラグ設定
				@param[in]		bRev		反転フラグ
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetReverse(TextureReverse bRev);
		/*************************************************************************//*!
				@brief			テクスチャアライメント設定
				@param[in]		bAlignment	テクスチャアライメント
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetAlignment(TextureAlignment bAlignment);
		
		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			テクスチャ取得
				@param			None

				@return			テクスチャ
		*//**************************************************************************/
		virtual LPTexture GetTexture(void);
		/*************************************************************************//*!
				@brief			幅取得
				@param			None

				@return			画像の幅
		*//**************************************************************************/
		virtual MofFloat GetWidth(void);
		/*************************************************************************//*!
				@brief			高さ取得
				@param			None

				@return			画像の高さ
		*//**************************************************************************/
		virtual MofFloat GetHeight(void);
		/*************************************************************************//*!
				@brief			アライメント取得
				@param			None

				@return			アライメント
		*//**************************************************************************/
		virtual TextureAlignment GetTextureAlignment(void);
		/*************************************************************************//*!
				@brief			反転フラグ取得
				@param			None

				@return			反転フラグ
		*//**************************************************************************/
		virtual TextureReverse GetReverse(void);
	};

	#include	"SpriteBase.inl"
}

#endif

//[EOF]