/*************************************************************************//*!
					
					@file	Sprite.h
					@brief	スプライト基底インターフェイス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SPRITE__H__

#define		__SPRITE__H__

//INCLUDE
#include	"Texture.h"

namespace Mof {
	
	/*******************************//*!
	@brief	スプライト基底インターフェイス

			スプライト基底となるインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API ISprite : public IMofNamedObject, public IMofCopyObject< ISprite > {
	protected:
	public:
		/*************************************************************************//*!
				@brief			スプライトの作成
				@param[in]		pName		画像ファイル名

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool CreateSprite(LPCMofChar pName) = 0;

		/*************************************************************************//*!
				@brief			スプライトの更新
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Update(void) = 0;

		/*************************************************************************//*!
				@brief			スプライトの描画
				@param			None

				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(void) = 0;

		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			テクスチャ設定
				@param[in]		pTex			設定するテクスチャ
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetTexture(LPTexture pTex) = 0;
		/*************************************************************************//*!
				@brief			画像矩形設定
				@param[in]		l			左
				@param[in]		t			上
				@param[in]		r			右
				@param[in]		b			下
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetImageRect(MofFloat l,MofFloat t,MofFloat r,MofFloat b) = 0;
		/*************************************************************************//*!
				@brief			画像矩形設定
				@param[in]		r			矩形
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetImageRect(const Rectangle& r) = 0;
		/*************************************************************************//*!
				@brief			アルファ値設定
				@param[in]		a			アルファ値
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetAlpha(MofFloat a) = 0;
		/*************************************************************************//*!
				@brief			反転フラグ設定
				@param[in]		bRev		反転フラグ
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetReverse(TextureReverse bRev) = 0;
		/*************************************************************************//*!
				@brief			テクスチャアライメント設定
				@param[in]		bAlignment	テクスチャアライメント
				
				@return			TRUE		正常に設定された<br>
								FALSE		設定の失敗
		*//**************************************************************************/
		virtual MofBool SetAlignment(TextureAlignment bAlignment) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			テクスチャ取得
				@param			None

				@return			テクスチャ
		*//**************************************************************************/
		virtual LPTexture GetTexture(void) = 0;
		/*************************************************************************//*!
				@brief			幅取得
				@param			None

				@return			画像の幅
		*//**************************************************************************/
		virtual MofFloat GetWidth(void) = 0;
		/*************************************************************************//*!
				@brief			高さ取得
				@param			None

				@return			画像の高さ
		*//**************************************************************************/
		virtual MofFloat GetHeight(void) = 0;
		/*************************************************************************//*!
				@brief			アライメント取得
				@param			None

				@return			アライメント
		*//**************************************************************************/
		virtual TextureAlignment GetTextureAlignment(void) = 0;
		/*************************************************************************//*!
				@brief			反転フラグ取得
				@param			None

				@return			反転フラグ
		*//**************************************************************************/
		virtual TextureReverse GetReverse(void) = 0;
	};

	//ポインタ置き換え
	typedef ISprite*			LPSprite;
}

#endif

//[EOF]