/*************************************************************************//*!
					
					@file	WriteMesh.h
					@brief	MOMファイルへの書き出しを行うクラス。

															@author	CDW
															@date	2015.12.04
*//**************************************************************************/

//ONCE
#ifndef		__WRITEMESH__H__

#define		__WRITEMESH__H__

//INCLUDE
#include	"MomCommon.h"
#include	"MeshContainer.h"

namespace Mof {
	
	/*******************************//*!
	@brief	メッシュファイル書き出しクラス

			メッシュをMOMファイルへ書き出すクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CWriteMesh : public CWriteChunkFile {
	private:
		/*************************************************************************//*!
				@brief			メッシュコンテナを書き出す
				@param[in]		pContainer	メッシュコンテナ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteMeshContainer(const LPMeshContainer pContainer);
		/*************************************************************************//*!
				@brief			メッシュを書き出す
				@param[in]		pMesh		メッシュ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteMesh(const LPMesh pMesh);
		/*************************************************************************//*!
				@brief			頂点を書き出す
				@param[in]		pVert		頂点バッファ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteVertex(LPVertexBuffer pVert);
		/*************************************************************************//*!
				@brief			インデックスを書き出す
				@param[in]		pInd		インデックスバッファ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteIndex(LPIndexBuffer pInd);
		/*************************************************************************//*!
				@brief			マテリアルを書き出す
				@param[in]		pMat		マテリアル
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteMaterial(LPMaterial pMat);
		/*************************************************************************//*!
				@brief			ボーンを書き出す
				@param[in]		pBone		ボーン
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteBone(LPBone pBone);
		/*************************************************************************//*!
				@brief			ボーンを書き出す
				@param[in]		pBone		ボーン
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteIK(LPBone pBone);
		/*************************************************************************//*!
				@brief			ボーンウェイトを書き出す
				@param[in]		Weight		ボーンウェイト
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteBoneWeight(const GEOMETRYBONEWEIGHT& Weight);
		/*************************************************************************//*!
				@brief			MOMファイルを書き出す
				@param[in]		pRigid		剛体情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteRigid(LPMOMPHYSICSRIGIDINFO pRigid);
		/*************************************************************************//*!
				@brief			MOMファイルを書き出す
				@param[in]		pJoint		ジョイント情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteRigidJoint(LPMOMPHYSICSJOINTINFO pJoint);
		/*************************************************************************//*!
				@brief			アニメーションを書き出す
				@param[in]		pAnim		アニメーション
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteAnimation(LPMeshAnimation pAnim);
		/*************************************************************************//*!
				@brief			カメラを書き出す
				@param[in]		pCamera		カメラ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteCamera(LPMeshCamera pCamera);
		/*************************************************************************//*!
				@brief			キーフレーム補間情報を書き出す
				@param[in]		kit			補間方法
				@param[in]		inval		補間情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool WriteKeyInterpolation(MofU32 kit,LPCMofFloat inval);
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CWriteMesh();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CWriteMesh();
		/*************************************************************************//*!
				@brief			メッシュを独自形式で出力を行う
				@param[in]		pMesh		出力するメッシュ
				@param[out]		pOutName	出力ファイル名
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool Save(const LPMeshContainer pMesh,const LPMofChar pOutName);
		
		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CWriteMesh,MOF_WRITEMESHCLASS_ID);
	};

	//INLINE INCLUDE
	#include	"WriteMesh.inl"

}

#endif	//__WRITEMESH__H__

//[EOF]
