/*************************************************************************//*!
					
					@file	GLIndexBuffer.h
					@brief	OpenGLインデックスバッファクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__GLINDEXBUFFER__H__

#define		__GLINDEXBUFFER__H__

//INCLUDE
#include	"../IndexBufferBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	OpenGLインデックスバッファクラス

			OpenGLでのインデックスバッファの作成、設定を行うためのインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CGLIndexBuffer : public CIndexBufferBase {
	protected:
		/*******************//*!
		インデックスバッファ
		*//********************/
		MofIndexBuffer				m_Buffer;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CGLIndexBuffer();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param			pObj		コピーバッファ

				@return			None
		*//**************************************************************************/
		CGLIndexBuffer(const CGLIndexBuffer& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CGLIndexBuffer();
		
		/*************************************************************************//*!
				@brief			バッファの作成
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool CreateBuffer(void);
		/*************************************************************************//*!
				@brief			コピーバッファの作成
				@param			None

				@return			作成されたコピーバッファ<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IIndexBuffer* CreateCopyObject(void) const;
						
		/*************************************************************************//*!
				@brief			バッファのマップ
				@param[in]		mt				マップタイプ
				
				@return			マップされたメモリアドレスを返す。<br>
								失敗の場合NULLになる。
		*//**************************************************************************/
		virtual LPMofVoid Map(MofU32 mt);
		/*************************************************************************//*!
				@brief			バッファのアンマップ
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool UnMap(void);
		/*************************************************************************//*!
				@brief			バッファの更新
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool UpdateBuffer(void);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			インデックスバッファ取得
				@param			None

				@return			インデックスバッファの取得
		*//**************************************************************************/
		virtual MofIndexBuffer GetBuffer(void) const;
		
		//クラス基本定義
		MOF_LIBRARYCLASS(CGLIndexBuffer,MOF_GLINDEXBUFFERCLASS_ID);
	};

	#include	"GLIndexBuffer.inl"
	
	//置き換え
	typedef CGLIndexBuffer	CIndexBuffer;
}

#endif

//[EOF]
