/*************************************************************************//*!
					
					@file	GLVertexBuffer.h
					@brief	OpenGL頂点バッファクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__GLVERTEXBUFFER__H__

#define		__GLVERTEXBUFFER__H__

//INCLUDE
#include	"../VertexBufferBase.h"

namespace Mof {
	
	/*******************************//*!
	@brief	OpenGL頂点バッファクラス

			OpenGLでの頂点バッファの作成、設定を行うためのインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CGLVertexBuffer : public CVertexBufferBase {
	protected:
		/*******************//*!
		頂点バッファ
		*//********************/
		MofVertexBuffer				m_Buffer;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CGLVertexBuffer();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param			pObj		コピーバッファ

				@return			None
		*//**************************************************************************/
		CGLVertexBuffer(const CGLVertexBuffer& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CGLVertexBuffer();
		
		/*************************************************************************//*!
				@brief			バッファの作成
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool CreateBuffer(void);
		/*************************************************************************//*!
				@brief			コピーバッファの作成
				@param			None

				@return			作成されたコピーバッファ<br>
								作成に失敗した場合NULLを返す
		*//**************************************************************************/
		virtual IVertexBuffer* CreateCopyObject(void) const;
		
		/*************************************************************************//*!
				@brief			バッファのマップ
				@param[in]		mt				マップタイプ
				
				@return			マップされたメモリアドレスを返す。<br>
								失敗の場合NULLになる。
		*//**************************************************************************/
		virtual LPMofVoid Map(MofU32 mt);
		/*************************************************************************//*!
				@brief			バッファのアンマップ
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool UnMap(void);
		/*************************************************************************//*!
				@brief			バッファの更新
				@param			None
				
				@return			TRUE			正常終了<br>
								それ以外		エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool UpdateBuffer(void);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			頂点バッファ取得
				@param			None

				@return			頂点バッファの取得
		*//**************************************************************************/
		virtual MofVertexBuffer GetBuffer(void) const;
		
		//クラス基本定義
		MOF_LIBRARYCLASS(CGLVertexBuffer,MOF_GLVERTEXBUFFERCLASS_ID);
	};

	#include	"GLVertexBuffer.inl"
	
	//置き換え
	typedef CGLVertexBuffer	CVertexBuffer;
}

#endif

//[EOF]
