/*************************************************************************//*!
					
					@file	Socket.h
					@brief	ソケットクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__SOCKET__H__

#define		__SOCKET__H__

//INCLUDE
#include	"NetworkCommon.h"

namespace Mof {
	
	/*******************************//*!
	@brief	ソケットクラス

			ソケットクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API ISocket : public IMofBase {
	protected:
	public:
		/*************************************************************************//*!
				@brief			ソケットの初期化
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		初期化エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Initialize(void) = 0;

		/*************************************************************************//*!
				@brief			ソケットのクローズ
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Close(void) = 0;
		
		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			ソケットの取得
				@param			None

				@return			ソケット
		*//**************************************************************************/
		virtual MOFSOCKET GetSocket(void) = 0;
	};
}

#endif

//[EOF]