/*************************************************************************//*!
					
					@file	AnalysMDL.h
					@brief	MDLファイルの解析を行うクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__ANALYSMDL__H__

#define		__ANALYSMDL__H__

//INCLUDE
#include	"../../Common/ReadFile.h"
#include	"ConvertMDL.h"

namespace Mof {

	//CLASS

	/*******************************//*!
	@brief	ＭＤＬファイル変換用解析クラス

			ＭＤＬファイル変換用解析クラス。

	@author	CDW
	*//********************************/
	class CAnalysMDL : public CReadBinaryFile {
	private:
		/*******************//*!
		コンバーター
		*//********************/
		CConvertMDL*				m_pConvert;
		/*******************//*!
		メッシュリスト
		*//********************/
		MBSMESHLIST					m_Mesh;

		/*************************************************************************//*!
				@brief			メッシュ解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysMDL(void);
		/*************************************************************************//*!
				@brief			頂点解析・変換
				@param[in]		pVL			頂点リスト
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysVertex(MBSMODELVERTEXLIST* pVL);
		/*************************************************************************//*!
				@brief			インデックス解析・変換
				@param[in]		pIL			インデックスリスト
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysIndex(LPMBSMODELINDEXLIST pIL);
		/*************************************************************************//*!
				@brief			マテリアル解析・変換
				@param[in]		pMesh		メッシュ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysMaterial(LPMBSMESH pMesh);
		/*************************************************************************//*!
				@brief			マテリアル解析・変換
				@param[in]		pMat		マテアリアル
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysTexture(MBSMATERIAL* pMat);
		/*************************************************************************//*!
				@brief			マテリアル解析・変換
				@param[in]		pMat		マテアリアル
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysShader(MBSMATERIAL* pMat);
		/*************************************************************************//*!
				@brief			ボーン解析・変換
				@param[in]		ckSize		チャンクサイズ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysBone(MofU32 ckSize);
		/*************************************************************************//*!
				@brief			アニメーションセット解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysAnimationSet(void);
		/*************************************************************************//*!
				@brief			アニメーション解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysAnimation(void);
		/*************************************************************************//*!
				@brief			ブロック解析・変換
				@param[in]		pMesh		メッシュ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysModelBlock(LPMBSMESH pMesh);
		/*************************************************************************//*!
				@brief			省略モデル解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysLowModelObject(void);
		/*************************************************************************//*!
				@brief			ボーングループ解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysBoneGroup(void);
		/*************************************************************************//*!
				@brief			IK解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysIK(void);
		/*************************************************************************//*!
				@brief			IKジョイント解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysIKJoint(void);
		/*************************************************************************//*!
				@brief			剛体解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysRigidBody(void);
		/*************************************************************************//*!
				@brief			剛体ジョイント解析・変換
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool AnalysJoint(void);
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CAnalysMDL();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CAnalysMDL();
		/*************************************************************************//*!
				@brief			ファイルを開いて解析を行い、独自形式で出力を行う
				@param[in]		pCon		変換用クラス
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool Analys(CConvertMDL* pCon);
		
		/*************************************************************************//*!
				@brief			ファイルから文字列型のデータを読みこむ
				@param[out]		str			文字列
				
				@return			TRUE		正常に読み込むことができた
								FALSE		読み込みエラー
		*//**************************************************************************/
		virtual MofBool ReadString(CString& str);

		/*************************************************************************//*!
				@brief			MDLファイルかを判定する
				@param			None
				
				@return			TRUE		MDLファイル<br>
								それ以外	MDLファイルではない
		*//**************************************************************************/
		MofBool IsMeshFile(void);
		
		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CAnalysMDL,MOF_ANALYSMDLCLASS_ID);
	};

	//INLINE INCLUDE
	#include	"AnalysMDL.inl"

}

#endif		//__ANALYSMDL__H__

//[EOF]