/*****************************************************************************
					
					［ファイル名］	ConvertVMD.h
					［処理概要］	VMDアニメーション変換クラス
					
															@author	CDW
															Since  2009.04.01
*****************************************************************************/

//ONCE
#ifndef		__CONVERTVMDANIMATION__H__

#define		__CONVERTVMDANIMATION__H__

//INCLUDE
#include	"../MeshContainer.h"
#include	"../BoneBase.h"
#include	"../MeshAnimationBase.h"
#include	"../MomCommon.h"

namespace Mof {

	//TYPEDEF STRUCT

	/*******************************//*!
	@brief	ＶＭＤファイルヘッダー構造体

			ＶＭＤファイルヘッダー構造体。

	@author	CDW
	*//********************************/
	typedef MOFLIBRARY_API struct tag_VMDHEADER {
		char							Header[30];								//!<Vocaloid Motion Data 00002
		char							MName[24];								//!<モデル名
	}VMDHEADER, *LPVMDHEADER;

	//CLASS
	
	/*******************************//*!
	@brief	ＶＭＤファイル変換クラス

			ＶＭＤファイルの変換を行うためのクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CConvertVMD : public CReadBinaryFile {
	private:
		/*******************//*!
		アニメーションン格納モデル
		*//********************/
		LPMeshContainer					m_pMesh;
		/*******************//*!
		アニメーションン
		*//********************/
		LPMeshAnimation					m_pAnimation;

		/*************************************************************************//*!
				@brief			メッシュファイルを変換する
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool Convert(void);
		/*************************************************************************//*!
				@brief			メッシュファイルを変換する
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ConvertAnimation(void);
		/*************************************************************************//*!
				@brief			メッシュファイルを変換する
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ConvertMorphing(void);
		/*************************************************************************//*!
				@brief			メッシュファイルを変換する
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ConvertCamera(void);
		/*************************************************************************//*!
				@brief			メッシュファイルを変換する
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ConvertLight(void);
		/*************************************************************************//*!
				@brief			メッシュファイルを変換する
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ConvertShadow(void);

		/*************************************************************************//*!
				@brief			メッシュファイルを変換する
				@param[out]		pData		ヘッダー
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadHeader(LPVMDHEADER pData);
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CConvertVMD();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CConvertVMD();
		/*************************************************************************//*!
				@brief			ファイルを開いて解析を行い、メッシュアニメーションとして返す
				@param[in]		pInName		入力ファイル名
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool Convert(LPCMofChar pInName);
		/*************************************************************************//*!
				@brief			ファイルを開いて解析を行い、メッシュアニメーションとして返す
				@param[in]		pInName		入力ファイル名
				@param[in]		pMesh		入力メッシュ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool Convert(LPCMofChar pInName,LPMeshContainer pMesh);
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		/*************************************************************************//*!
				@brief			アニメーション取得
				@param			None

				@return			アニメーションの取得
		*//**************************************************************************/
		virtual LPMeshAnimation GetAnimation(void);

		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CConvertVMD, MOF_CONVERTVMDCLASS_ID);
	};

		//INLINE INCLUDE
	#include	"ConvertVMD.inl"

}

#endif	//__CONVERTVMDANIMATION__H__

//[EOF]