/*************************************************************************//*!
					
					@file	ALSound.h
					@brief	OpenALでの各種サウンドの処理を行うクラス。

															@author	濱田　享
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__ALSOUND__H__

#define		__ALSOUND__H__

//INCLUDE
#include	"../Sound.h"

namespace Mof {
	
	/*******************************//*!
	@brief	サウンド基底インターフェイス

			サウンドの基底となるインターフェイス。

	@author	濱田　享
	*//********************************/
	class MOFLIBRARY_API CALSound : public ISound {
	protected:
		/*******************//*!
		ALデバイス
		*//********************/
		ALCdevice*				m_ALDevice;
		/*******************//*!
		ALコンテキスト
		*//********************/
		ALCcontext*				m_ALContext;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CALSound();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CALSound();

		/*************************************************************************//*!
				@brief			サウンドオブジェクトの生成
				@param[in]		pInfo		サウンドの生成情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPSOUNDCREATEINFO pInfo);

		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			サウンドデバイス取得<br>
								使用しない環境で呼び出した場合NULLを返す。
				@param			None

				@return			サウンドデバイス
		*//**************************************************************************/
		virtual MofSoundDevice GetDevice(void);

		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CALSound,MOF_ALSOUNDCLASS_ID);
	};

	#include	"ALSound.inl"
}

#endif

//[EOF]