/*************************************************************************//*!
					
					@file	AnalysX.h
					@brief	Xファイルの解析を行いCXModelクラスに設定を行うクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__ANALYSXFILE__H__

#define		__ANALYSXFILE__H__

//INCLUDE
#include	"../../Common/ReadFile.h"
#include	"XModel.h"

namespace Mof {

	/*******************************//*!
	@brief	Ｘファイル解析クラス

			テキスト形式のＸファイルの解析を行うためのクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CAnalysX : public CReadTextFile {
	private:
		/*************************************************************************//*!
				@brief			メッシュ面情報テンプレートの解析を行う
				@param[in]		Face		解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadMeshFace(LPMOFXMESHFACE Face);
		/*************************************************************************//*!
				@brief			メッシュ法線情報テンプレートの解析を行う
				@param[in]		Normal		解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadMeshNormal(LPMOFXMESHNORMAL Normal);
		/*************************************************************************//*!
				@brief			メッシュUV情報テンプレートの解析を行う
				@param[in]		TC			解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadTextureCoords(LPMOFXTEXTURECOORDS TC);
		/*************************************************************************//*!
				@brief			メッシュテクスチャファイル名情報テンプレートの解析を行う
				@param[in]		pName		ファイル名
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadTextureFileName(LPString pName);
		/*************************************************************************//*!
				@brief			メッシュ頂点カラー情報テンプレートの解析を行う
				@param[in]		VCK			解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadColorKey(LPMOFXVERTEXCOLORKEY VCK);
		/*************************************************************************//*!
				@brief			メッシュ頂点カラー情報テンプレートの解析を行う
				@param[in]		VC			解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadVertexColor(LPMOFXVERTEXCOLORS VC);
		/*************************************************************************//*!
				@brief			メッシュマテリアル情報テンプレートの解析を行う
				@param[in]		Material	解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadMaterial(LPMOFXMATERIAL Material);
		/*************************************************************************//*!
				@brief			メッシュマテリアルリスト情報テンプレートの解析を行う
				@param[in]		ML			解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadMaterialList(LPMOFXMATERIALLIST ML);
		/*************************************************************************//*!
				@brief			メッシュFloatキー情報テンプレートの解析を行う
				@param[in]		fkey		解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadFloatKeys(LPMOFXFLOATKEYS fkey);
		/*************************************************************************//*!
				@brief			メッシュ時間Floatキー情報テンプレートの解析を行う
				@param[in]		tkey		解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadTimeFloatKeys(LPMOFXTIMEFLOATKEYS tkey);
		/*************************************************************************//*!
				@brief			メッシュアニメーションキー情報テンプレートの解析を行う
				@param[in]		akey		解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadAnimationKey(LPMOFXANIMATIONKEY akey);
		/*************************************************************************//*!
				@brief			メッシュスキニングヘッダー情報テンプレートの解析を行う
				@param[in]		Header		解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadXSkinHeader(LPMOFXSKINHEADER Header);
		/*************************************************************************//*!
				@brief			メッシュスキニングウェイト情報テンプレートの解析を行う
				@param[in]		SWeights	解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadSkinWeights(LPMOFXSKINWEIGHTS SWeights);
		/*************************************************************************//*!
				@brief			メッシュ情報テンプレートの解析を行う
				@param[in]		Mesh		解析データ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool ReadMesh(LPMOFXMESH Mesh);
		/*************************************************************************//*!
				@brief			Xファイルかを判定する<br>
								ファイルの先頭がxofから始まればXファイル
				@param			None
				
				@return			TRUE		Xファイル<br>
								それ以外	Xファイルではない
		*//**************************************************************************/
		MofBool IsXFile(void);
		/*************************************************************************//*!
				@brief			テキスト形式のXファイルかを判定する<br>
								ファイルの先頭がxofから始まりtxt指定があればテキスト形式のXファイル
				@param			None
				
				@return			TRUE		テキスト形式のXファイル<br>
								それ以外	テキスト形式のXファイルではない
		*//**************************************************************************/
		MofBool IsTextXFile(void);
		/*************************************************************************//*!
				@brief			ファイルからオフセットを移動させずに文字列型のデータを読みこむ
				@param[out]		str			文字列
				
				@return			TRUE		正常に読み込むことができた
								FALSE		読み込みエラー
		*//**************************************************************************/
		MofBool NoMoveGetString(LPMofChar str);
		/*************************************************************************//*!
				@brief			関係データのリンクを設定する
				@param[in]		pModel		設定モデル
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool SetRelationData(LPXModel pModel);
		/*************************************************************************//*!
				@brief			メッシュデータの行列を設定する
				@param[in]		pFrame		設定フレーム
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool SetFrameMatrix(LPMOFXMESHFRAME pFrame);
		/*************************************************************************//*!
				@brief			メッシュデータの描画インデックスを設定する
				@param[in]		pMesh		設定メッシュ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool SetRenderData(LPMOFXMESH pMesh);
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CAnalysX();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CAnalysX();
		/*************************************************************************//*!
				@brief			ファイルを開いて解析を行う
				@param[in]		pName		ファイル名
				@param[out]		pModel		出力モデル
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		MofBool Analys(LPCMofChar pName,LPXModel pModel);
		
		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CAnalysX,MOF_ANALYSXCLASS_ID);
	};

	//INLINE INCLUDE
	#include	"AnalysX.inl"

}

#endif	//__ANALYSXFILE__H__

//[EOF]