/*************************************************************************//*!
					
					@file	Movie.h
					@brief	動画基底インターフェイス。

															@author	CDW
															@date	2015.11.20
*//**************************************************************************/

//ONCE
#ifndef		__MOVIE__H__

#define		__MOVIE__H__

//INCLUDE
#include	"../Graphics/Texture.h"

namespace Mof {
	
	/*******************************//*!
	@brief	再生状態列挙

			動画の再生状態の列挙

	@author	CDW
	*//********************************/
	typedef enum MoviePlayState {
		MOVIEPLAYSTATE_STOPPED,		//!<停止中
		MOVIEPLAYSTATE_PAUSED,		//!<一時停止中
		MOVIEPLAYSTATE_RUNNING,		//!<再生中
	}MoviePlayState;

	/*******************************//*!
	@brief	動画基底インターフェイス

			動画基底となるインターフェイス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API IMovie : public IMofNamedObject {
	protected:
	public:
		/*************************************************************************//*!
				@brief			動画の読み込み
				@param[in]		pName		ファイル名
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Load(LPCMofChar pName) = 0;
		
		/*************************************************************************//*!
				@brief			再生
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Play(void) = 0;
		/*************************************************************************//*!
				@brief			別ウィンドウを開いて再生
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool PlayChildWindow(void) = 0;
		/*************************************************************************//*!
				@brief			一時停止
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Pause(void) = 0;
		/*************************************************************************//*!
				@brief			次のフレームへ
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool StepOneFrame(void) = 0;
		/*************************************************************************//*!
				@brief			停止
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Stop(void) = 0;
		/*************************************************************************//*!
				@brief			閉じる
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Close(void) = 0;
		/*************************************************************************//*!
				@brief			テクスチャの表示更新
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Update(void) = 0;
		/*************************************************************************//*!
				@brief			動画の描画
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render() = 0;
		/*************************************************************************//*!
				@brief			動画の描画
				@param[in]		px			描画X座標
				@param[in]		py			描画Y座標
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(MofFloat px,MofFloat py) = 0;
		/*************************************************************************//*!
				@brief			動画の描画
				@param[in]		drec		描画矩形
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(const Rectangle& drec) = 0;
		/*************************************************************************//*!
				@brief			動画の描画
				@param[in]		drec		描画矩形
				@param[in]		srec		画像表示矩形
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(const Rectangle& drec,const Rectangle& srec) = 0;
		
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			レート設定
				@param[in]		Rate			レート
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetRate(MofDouble Rate) = 0;
		/*************************************************************************//*!
				@brief			音量設定
				@param[in]		Vol				音量(0.0(無音)～1.0(通常))
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetVolume(MofFloat Vol) = 0;
		/*************************************************************************//*!
				@brief			子ウィンドウをアクティブにする
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetForeground(void) = 0;

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			現在位置取得
				@param			None

				@return			現在位置
		*//**************************************************************************/
		virtual MofDouble GetPosition(void) = 0;
		/*************************************************************************//*!
				@brief			終了時間取得
				@param			None

				@return			終了時間
		*//**************************************************************************/
		virtual MofDouble GetEndTime(void) = 0;
		/*************************************************************************//*!
				@brief			レート取得
				@param			None

				@return			レート
		*//**************************************************************************/
		virtual MofDouble GetRate(void) = 0;
		/*************************************************************************//*!
				@brief			音量取得
				@param			None

				@return			音量(0.0(無音)～1.0(通常))
		*//**************************************************************************/
		virtual MofFloat GetVolume(void) = 0;
		/*************************************************************************//*!
				@brief			子供フラグ取得
				@param			None

				@return			子供フラグ
		*//**************************************************************************/
		virtual MofBool GetChildFlag(void) = 0;
		/*************************************************************************//*!
				@brief			バッファを取得
				@param			None

				@return			バッファ
		*//**************************************************************************/
		virtual LPMofU8 GetSamplesBuffer(void) = 0;
		/*************************************************************************//*!
				@brief			バッファのサイズを取得
				@param			None

				@return			バッファのサイズ
		*//**************************************************************************/
		virtual MofU32 GetSamplesBufferSize(void) = 0;
		/*************************************************************************//*!
				@brief			幅取得
				@param			None

				@return			画像の幅
		*//**************************************************************************/
		virtual MofU32 GetWidth(void) = 0;
		/*************************************************************************//*!
				@brief			高さ取得
				@param			None

				@return			画像の高さ
		*//**************************************************************************/
		virtual MofU32 GetHeight(void) = 0;
		/*************************************************************************//*!
				@brief			テクスチャ取得
				@param			None

				@return			テクスチャ
		*//**************************************************************************/
		virtual LPTexture GetTexture(void)= 0;

		/*************************************************************************//*!
				@brief			再生中か判定
				@param			None

				@return			再生中か否か取得
		*//**************************************************************************/
		virtual MofBool IsPlay(void) = 0;
	};

	//ポインタ置き換え
	typedef IMovie*			LPMovie;
}

#endif

//[EOF]