/*************************************************************************//*!
					
					@file	MovieBase.h
					@brief	動画基底クラス。

															@author	CDW
															@date	2015.11.23
*//**************************************************************************/

//ONCE
#ifndef		__MOVIEBASE__H__

#define		__MOVIEBASE__H__

//INCLUDE
#include	"Movie.h"

namespace Mof {

	/*******************************//*!
	@brief	動画基底クラス

			動画基底となるクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CMovieBase : public IMovie{
	protected:
		/*******************//*!
		再生フラグ
		*//********************/
		MoviePlayState				m_State;
		
		/*******************//*!
		名前
		*//********************/
		CString						m_Name;
		/*******************//*!
		幅
		*//********************/
		MofU32						m_Width;
		/*******************//*!
		高さ
		*//********************/
		MofU32						m_Height;
	public:
		
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CMovieBase();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピー元

				@return			None
		*//**************************************************************************/
		CMovieBase(const CMovieBase& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CMovieBase();
		/*************************************************************************//*!
				@brief			動画の描画
				@param			None
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render();
		/*************************************************************************//*!
				@brief			動画の描画
				@param[in]		px			描画X座標
				@param[in]		py			描画Y座標
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(MofFloat px,MofFloat py);
		/*************************************************************************//*!
				@brief			動画の描画
				@param[in]		drec		描画矩形
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(const Rectangle& drec);
		/*************************************************************************//*!
				@brief			動画の描画
				@param[in]		drec		描画矩形
				@param[in]		srec		画像表示矩形
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Render(const Rectangle& drec,const Rectangle& srec);
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前設定
				@param[in]		pName			設定する名前
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetName(LPCMofChar pName);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			名前取得
				@param			None

				@return			名前の取得
		*//**************************************************************************/
		virtual LPString GetName(void);
		/*************************************************************************//*!
				@brief			幅取得
				@param			None

				@return			画像の幅
		*//**************************************************************************/
		virtual MofU32 GetWidth(void);
		/*************************************************************************//*!
				@brief			高さ取得
				@param			None

				@return			画像の高さ
		*//**************************************************************************/
		virtual MofU32 GetHeight(void);
	};

	#include "MovieBase.inl"
}

#endif

//[EOF]