/*************************************************************************//*!
					
					@file	WinWindow.h
					@brief	ウインドウズ用のウインドウの処理を行うクラス。

															@author	CDW
															@date	2014.05.14
*//**************************************************************************/

//ONCE
#ifndef		__WINWINDOW__H__

#define		__WINWINDOW__H__

//INCLUDE
#include	"DefWindowProc.h"
#include	"ImeProc.h"

namespace Mof {
	/*******************************//*!
	@brief	ウインドウズ用ウインドウクラス

			ウインドウズ用の標準的なウインドウの処理を行うクラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CWindow : public CWindowBase {
	protected:
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CWindow();
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CWindow();
		/*************************************************************************//*!
				@brief			ウインドウの生成
				@param[in]		pInfo		ウインドウの生成情報
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPWINDOWCREATEINFO pInfo);
		/*************************************************************************//*!
				@brief			ウインドウの生成<br>
								内部でWINDOWCREATEINFOを生成して、ウインドウを作成する。<br>
								引数に存在しないパラメーターは環境の基本値が適用される。
				@param[in]		pTitle		ウインドウのタイトル
				@param[in]		w			ウインドウの幅
				@param[in]		h			ウインドウの高さ
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Create(LPCMofChar pTitle,MofS32 w,MofS32 h);
		
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			画面サイズを設定する
				@param[in]		sw				幅
				@param[in]		sh				高さ
				@param[in]		bSet			ウインドウのサイズを実際に変更するか否か<br>
												TRUEの場合Windowサイズを変更するAPIを実行する。<br>
												FALSEの場合メンバのWidth,Heightの変更のみでAPIによるサイズの変更は行わない。
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool SetScreenSize(MofS32 sw,MofS32 sh, MofBool bSet = TRUE);

		//クラス基本定義
		MOF_LIBRARYCLASS_NOTCOPY(CWindow,MOF_WINDOWCLASS_ID);
	};

}

#endif

//[EOF]