/*************************************************************************//*!
					
					@file	DShowMovie.h
					@brief	DirectShow動画クラス。

															@author	CDW
															@date	2015.11.23
*//**************************************************************************/

//ONCE
#ifndef		__DSHOWMOVIE__H__

#define		__DSHOWMOVIE__H__

//INCLUDE
#include	"../MovieBase.h"
#include	<dshow.h>
#pragma include_alias( "dxtrans.h", "qedit.h" )
#define		__IDxtCompositor_INTERFACE_DEFINED__
#define		__IDxtAlphaSetter_INTERFACE_DEFINED__
#define		__IDxtJpeg_INTERFACE_DEFINED__
#define		__IDxtKey_INTERFACE_DEFINED__
#include	"qedit.h"
#pragma comment(lib,"Strmiids.lib")

namespace Mof {

	/*******************************//*!
	@brief	DirectShow動画クラス

			DirectShow動画クラス。

	@author	CDW
	*//********************************/
	class MOFLIBRARY_API CDShowMovie : public CMovieBase{
	protected:
		/*******************//*!
		フィルタグラフ
		*//********************/
		IGraphBuilder*				m_pGB;

		/*******************//*!
		ストリーム操作
		*//********************/
		IMediaControl*				m_pMC;
		/*******************//*!
		イベント通知
		*//********************/
		IMediaEventEx*				m_pME;
		/*******************//*!
		表示先のウインドウ
		*//********************/
		IVideoWindow*				m_pVW;
		/*******************//*!
		オーディオの操作
		*//********************/
		IBasicAudio*				m_pBA;
		/*******************//*!
		ビデオの操作
		*//********************/
		IBasicVideo*				m_pBV;
		/*******************//*!
		シーク操作や再生レート操作
		*//********************/
		IMediaSeeking*				m_pMS;
		/*******************//*!
		再生位置操作
		*//********************/
		IMediaPosition*				m_pMP;
		/*******************//*!
		コマ送り
		*//********************/
		IVideoFrameStep*			m_pFS;

		/*******************//*!
		フィルタ
		*//********************/
		IBaseFilter*				m_pSF;
		/*******************//*!
		フィルタ
		*//********************/
		ISampleGrabber*				m_pSP;

		/*******************//*!
		取得バッファサイズ
		*//********************/
		MofS32						m_BufferSize;
		/*******************//*!
		取得バッファ
		*//********************/
		LPMofU8						m_pBuffer;
		/*******************//*!
		子供フラグ
		*//********************/
		MofBool						m_ChildWindow;

		/*******************//*!
		テクスチャ
		*//********************/
		LPTexture					m_pTexture;
	public:
		
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CDShowMovie();
		/*************************************************************************//*!
				@brief			コピーコンストラクタ
				@param[in]		pObj		コピー元

				@return			None
		*//**************************************************************************/
		CDShowMovie(const CDShowMovie& pObj);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		virtual ~CDShowMovie();

		/*************************************************************************//*!
				@brief			動画の読み込み
				@param[in]		pName		ファイル名
				
				@return			TRUE		成功<br>
								それ以外	失敗、エラーコードが戻り値となる
		*//**************************************************************************/
		virtual MofBool Load(LPCMofChar pName);
		
		/*************************************************************************//*!
				@brief			再生
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Play(void);
		/*************************************************************************//*!
				@brief			別ウィンドウを開いて再生
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool PlayChildWindow(void);
		/*************************************************************************//*!
				@brief			一時停止
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Pause(void);
		/*************************************************************************//*!
				@brief			次のフレームへ
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool StepOneFrame(void);
		/*************************************************************************//*!
				@brief			停止
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Stop(void);
		/*************************************************************************//*!
				@brief			閉じる
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Close(void);
		/*************************************************************************//*!
				@brief			テクスチャの表示更新
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Update(void);
		/*************************************************************************//*!
				@brief			解放
				@param[in]		pData			解放追加データ

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool Release(LPMofVoid pData = NULL);
		
		//----------------------------------------------------------------------------
		////Set
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			レート設定
				@param[in]		Rate			レート
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetRate(MofDouble Rate);
		/*************************************************************************//*!
				@brief			音量設定
				@param[in]		Vol				音量(0.0(無音)～1.0(通常))
				
				@return			TRUE			正常終了<br>
								それ以外		設定エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetVolume(MofFloat Vol);
		/*************************************************************************//*!
				@brief			子ウィンドウをアクティブにする
				@param			None

				@return			TRUE			正常終了<br>
								それ以外		解放エラー、エラーコードを返す。
		*//**************************************************************************/
		virtual MofBool SetForeground(void);

		//----------------------------------------------------------------------------
		////Get
		//----------------------------------------------------------------------------
		/*************************************************************************//*!
				@brief			現在位置取得
				@param			None

				@return			現在位置
		*//**************************************************************************/
		virtual MofDouble GetPosition(void);
		/*************************************************************************//*!
				@brief			終了時間取得
				@param			None

				@return			終了時間
		*//**************************************************************************/
		virtual MofDouble GetEndTime(void);
		/*************************************************************************//*!
				@brief			レート取得
				@param			None

				@return			レート
		*//**************************************************************************/
		virtual MofDouble GetRate(void);
		/*************************************************************************//*!
				@brief			音量取得
				@param			None

				@return			音量(0.0(無音)～1.0(通常))
		*//**************************************************************************/
		virtual MofFloat GetVolume(void);
		/*************************************************************************//*!
				@brief			子供フラグ取得
				@param			None

				@return			子供フラグ
		*//**************************************************************************/
		virtual MofBool GetChildFlag(void);
		/*************************************************************************//*!
				@brief			バッファを取得
				@param			None

				@return			バッファ
		*//**************************************************************************/
		virtual LPMofU8 GetSamplesBuffer(void);
		/*************************************************************************//*!
				@brief			バッファのサイズを取得
				@param			None

				@return			バッファのサイズ
		*//**************************************************************************/
		virtual MofU32 GetSamplesBufferSize(void);
		/*************************************************************************//*!
				@brief			テクスチャ取得
				@param			None

				@return			テクスチャ
		*//**************************************************************************/
		virtual LPTexture GetTexture(void);

		/*************************************************************************//*!
				@brief			再生中か判定
				@param			None

				@return			再生中か否か取得
		*//**************************************************************************/
		virtual MofBool IsPlay(void);

		//クラス基本定義
		MOF_LIBRARYCLASS(CDShowMovie,MOF_DSHOWMOVIECLASS_ID);
	};

	#include "DShowMovie.inl"

	//置き換え
	typedef CDShowMovie			CMovie;
}

#endif

//[EOF]